[Killed] BlockStatement
lib/classroom-privacy.ts:8:63
  * The label depends only on the server-side group order, so repeated snapshots
  * use the same anonymous label without exposing the stored group position.
  */
-export function anonymousAnswerLabel(ordinal: number): string {
-  if (!Number.isSafeInteger(ordinal) || ordinal < 0) {
-    throw new Error("Anonymous answer ordinal must be a non-negative integer.");
-  }
-  let value = ordinal + 1;
-  let suffix = "";
-  while (value > 0) {
-    value -= 1;
-    suffix = String.fromCharCode(65 + value % 26) + suffix;
-    value = Math.floor(value / 26);
-  }
-  return `回答 ${suffix}`;
-}
+export function anonymousAnswerLabel(ordinal: number): string {}
 
 export function classroomQuestionGroupId(
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (20.5206ms)

✔ student result comparison removes the student's ow

[Killed] BooleanLiteral
lib/classroom-privacy.ts:9:7
  * use the same anonymous label without exposing the stored group position.
  */
 export function anonymousAnswerLabel(ordinal: number): string {
-  if (!Number.isSafeInteger(ordinal) || ordinal < 0) {
+  if (Number.isSafeInteger(ordinal) || ordinal < 0) {
     throw new Error("Anonymous answer ordinal must be a non-negative integer.");
   }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7701ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-privacy.ts:9:54
  * use the same anonymous label without exposing the stored group position.
  */
 export function anonymousAnswerLabel(ordinal: number): string {
-  if (!Number.isSafeInteger(ordinal) || ordinal < 0) {
-    throw new Error("Anonymous answer ordinal must be a non-negative integer.");
-  }
+  if (!Number.isSafeInteger(ordinal) || ordinal < 0) {}
   let value = ordinal + 1;
   let suffix = "";
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8491ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-privacy.ts:12:15
   if (!Number.isSafeInteger(ordinal) || ordinal < 0) {
     throw new Error("Anonymous answer ordinal must be a non-negative integer.");
   }
-  let value = ordinal + 1;
+  let value = ordinal - 1;
   let suffix = "";
   while (value > 0) {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (6.2939ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-privacy.ts:14:10
   }
   let value = ordinal + 1;
   let suffix = "";
-  while (value > 0) {
+  while (value <= 0) {
     value -= 1;
     suffix = String.fromCharCode(65 + value % 26) + suffix;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.0427ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-privacy.ts:14:10
   }
   let value = ordinal + 1;
   let suffix = "";
-  while (value > 0) {
+  while (value >= 0) {
     value -= 1;
     suffix = String.fromCharCode(65 + value % 26) + suffix;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (56.4709ms)

✔ student result comparison removes the student's ow

[Killed] AssignmentOperator
lib/classroom-privacy.ts:15:5
   let value = ordinal + 1;
   let suffix = "";
   while (value > 0) {
-    value -= 1;
+    value += 1;
     suffix = String.fromCharCode(65 + value % 26) + suffix;
     value = Math.floor(value / 26);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8514ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-privacy.ts:16:14
   let suffix = "";
   while (value > 0) {
     value -= 1;
-    suffix = String.fromCharCode(65 + value % 26) + suffix;
+    suffix = String.fromCharCode(65 + value % 26) - suffix;
     value = Math.floor(value / 26);
   }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8159ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-privacy.ts:16:34
   let suffix = "";
   while (value > 0) {
     value -= 1;
-    suffix = String.fromCharCode(65 + value % 26) + suffix;
+    suffix = String.fromCharCode(65 - value % 26) + suffix;
     value = Math.floor(value / 26);
   }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (11.1795ms)

✔ student result comparison removes the student's ow

[Timeout] ArithmeticOperator
lib/classroom-privacy.ts:17:24
   while (value > 0) {
     value -= 1;
     suffix = String.fromCharCode(65 + value % 26) + suffix;
-    value = Math.floor(value / 26);
+    value = Math.floor(value * 26);
   }
   return `回答 ${suffix}`;

[Killed] BlockStatement
lib/classroom-privacy.ts:26:18
   hasSelectedQuestion: boolean,
   membershipGroupId: string | null,
   participantGroupId: string | null,
-): string | null {
-  return hasSelectedQuestion ? membershipGroupId : participantGroupId;
-}
+): string | null {}
 
 /**
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (16.1745ms)

✔ student result comparison removes the student's ow

[Killed] BlockStatement
lib/classroom-privacy.ts:39:12
 export function studentMaySeeGroupNames(
   questionPhase: string | null | undefined,
   keepPublishedResultsAnonymous: boolean,
-): boolean {
-  return !keepPublishedResultsAnonymous
-    && (questionPhase === "published" || questionPhase === "archived");
-}
+): boolean {}
 
 /**
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.9105ms)

✔ student result comparison removes the student's own

[Killed] LogicalOperator
lib/classroom-privacy.ts:40:10
   questionPhase: string | null | undefined,
   keepPublishedResultsAnonymous: boolean,
 ): boolean {
-  return !keepPublishedResultsAnonymous
-    && (questionPhase === "published" || questionPhase === "archived");
+  return !keepPublishedResultsAnonymous || questionPhase === "published" || questionPhase === "archived";
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.9003ms)

✔ student result comparison removes the student's own

[Killed] BooleanLiteral
lib/classroom-privacy.ts:40:10
   questionPhase: string | null | undefined,
   keepPublishedResultsAnonymous: boolean,
 ): boolean {
-  return !keepPublishedResultsAnonymous
+  return keepPublishedResultsAnonymous
     && (questionPhase === "published" || questionPhase === "archived");
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (3.9025ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-privacy.ts:41:9
   keepPublishedResultsAnonymous: boolean,
 ): boolean {
   return !keepPublishedResultsAnonymous
-    && (questionPhase === "published" || questionPhase === "archived");
+    && (false || questionPhase === "archived");
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (5.7374ms)

✔ student result comparison removes the student's own

[Killed] LogicalOperator
lib/classroom-privacy.ts:41:9
   keepPublishedResultsAnonymous: boolean,
 ): boolean {
   return !keepPublishedResultsAnonymous
-    && (questionPhase === "published" || questionPhase === "archived");
+    && (questionPhase === "published" && questionPhase === "archived");
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.6398ms)

✔ student result comparison removes the student's own

[Killed] BooleanLiteral
lib/classroom-privacy.ts:56:21
 export function classroomGroupsForViewer(
   groups: readonly ClassroomGroup[],
   isAdministrator: boolean,
-  anonymousGroups = true,
+  anonymousGroups = false,
 ): ClassroomGroup[] {
   if (isAdministrator) {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.7516ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-privacy.ts:58:7
   isAdministrator: boolean,
   anonymousGroups = true,
 ): ClassroomGroup[] {
-  if (isAdministrator) {
+  if (true) {
     return groups.map((group) => ({
       ...group,
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.9635ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-privacy.ts:58:24
   isAdministrator: boolean,
   anonymousGroups = true,
 ): ClassroomGroup[] {
-  if (isAdministrator) {
-    return groups.map((group) => ({
-      ...group,
-      members: group.members.map((member) => ({ ...member })),
-      response: { ...group.response },
-    }));
-  }
+  if (isAdministrator) {}
 
   const stableOrder = [...groups].sort((left, right) =>
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.4566ms)

✔ student result comparison removes the student's own

[Killed] ArrowFunction
lib/classroom-privacy.ts:59:23
   anonymousGroups = true,
 ): ClassroomGroup[] {
   if (isAdministrator) {
-    return groups.map((group) => ({
-      ...group,
-      members: group.members.map((member) => ({ ...member })),
-      response: { ...group.response },
-    }));
+    return groups.map(() => undefined);
   }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.6527ms)

✔ student result comparison removes the student's own

[Killed] ObjectLiteral
lib/classroom-privacy.ts:59:35
   anonymousGroups = true,
 ): ClassroomGroup[] {
   if (isAdministrator) {
-    return groups.map((group) => ({
-      ...group,
-      members: group.members.map((member) => ({ ...member })),
-      response: { ...group.response },
-    }));
+    return groups.map((group) => ({}));
   }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7334ms)

✔ student result comparison removes the student's own

[Killed] ArrowFunction
lib/classroom-privacy.ts:61:34
   if (isAdministrator) {
     return groups.map((group) => ({
       ...group,
-      members: group.members.map((member) => ({ ...member })),
+      members: group.members.map(() => undefined),
       response: { ...group.response },
     }));
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (3.098ms)

✔ student result comparison removes the student's own

[Killed] ArrowFunction
lib/classroom-privacy.ts:66:40
     }));
   }
 
-  const stableOrder = [...groups].sort((left, right) =>
-    left.position - right.position || left.id.localeCompare(right.id, "en"));
+  const stableOrder = [...groups].sort(() => undefined);
   const anonymousLabels = new Map(
     stableOrder.map((group, index) => [group.id, anonymousAnswerLabel(index)]),
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8817ms)

✔ student result comparison removes the student's own

[Killed] MethodExpression
lib/classroom-privacy.ts:66:23
     }));
   }
 
-  const stableOrder = [...groups].sort((left, right) =>
-    left.position - right.position || left.id.localeCompare(right.id, "en"));
+  const stableOrder = [...groups];
   const anonymousLabels = new Map(
     stableOrder.map((group, index) => [group.id, anonymousAnswerLabel(index)]),
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (5.0968ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-privacy.ts:67:5
   }
 
   const stableOrder = [...groups].sort((left, right) =>
-    left.position - right.position || left.id.localeCompare(right.id, "en"));
+    false);
   const anonymousLabels = new Map(
     stableOrder.map((group, index) => [group.id, anonymousAnswerLabel(index)]),
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (3.9083ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-privacy.ts:67:5
   }
 
   const stableOrder = [...groups].sort((left, right) =>
-    left.position - right.position || left.id.localeCompare(right.id, "en"));
+    left.position + right.position || left.id.localeCompare(right.id, "en"));
   const anonymousLabels = new Map(
     stableOrder.map((group, index) => [group.id, anonymousAnswerLabel(index)]),
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7889ms)

✔ student result comparison removes the student's own

[Killed] ArrowFunction
lib/classroom-privacy.ts:69:21
   const stableOrder = [...groups].sort((left, right) =>
     left.position - right.position || left.id.localeCompare(right.id, "en"));
   const anonymousLabels = new Map(
-    stableOrder.map((group, index) => [group.id, anonymousAnswerLabel(index)]),
+    stableOrder.map(() => undefined),
   );
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8799ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-privacy.ts:72:32
     stableOrder.map((group, index) => [group.id, anonymousAnswerLabel(index)]),
   );
 
-  return groups.map((group) => {
-    const safeGroup = {
-      id: group.id,
-      label: anonymousGroups ? anonymousLabels.get(group.id)! : group.label,
-      representativeUserId: null,
-      members: [],
-      response: { ...group.response },
-    };
-    return safeGroup as unknown as ClassroomGroup;
-  });
+  return groups.map((group) => {});
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.5478ms)

✔ student result comparison removes the student's own

[Killed] ArrayDeclaration
lib/classroom-privacy.ts:77:16
       id: group.id,
       label: anonymousGroups ? anonymousLabels.get(group.id)! : group.label,
       representativeUserId: null,
-      members: [],
+      members: ["Stryker was here"],
       response: { ...group.response },
     };
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.6934ms)

✔ student result comparison removes the student's own
