[Killed] BlockStatement
lib/classroom-domain.ts:297:90
   return `${course.academicYear}學年度 ${term}`;
 }
 
-export function balancedGroupSizes(participantCount: number, capacity: number): number[] {
-  if (!Number.isSafeInteger(participantCount) || participantCount <= 0) return [];
-  if (!validGroupCapacity(capacity)) throw new Error("Group capacity is outside the supported range.");
-  const groupCount = Math.ceil(participantCount / capacity);
-  const minimum = Math.floor(participantCount / groupCount);
-  const remainder = participantCount % groupCount;
-  return Array.from({ length: groupCount }, (_, index) => minimum + (index < remainder ? 1 : 0));
-}
+export function balancedGroupSizes(participantCount: number, capacity: number): number[] {}
 
 export function balancedGroupSizesByCount(participantCount: number, groupCount: number): number[] {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (35.4699ms)

✔ student result comparison removes the student's ow

[Killed] BooleanLiteral
lib/classroom-domain.ts:298:7
 }
 
 export function balancedGroupSizes(participantCount: number, capacity: number): number[] {
-  if (!Number.isSafeInteger(participantCount) || participantCount <= 0) return [];
+  if (Number.isSafeInteger(participantCount) || participantCount <= 0) return [];
   if (!validGroupCapacity(capacity)) throw new Error("Group capacity is outside the supported range.");
   const groupCount = Math.ceil(participantCount / capacity);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (9.6233ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-domain.ts:298:50
 }
 
 export function balancedGroupSizes(participantCount: number, capacity: number): number[] {
-  if (!Number.isSafeInteger(participantCount) || participantCount <= 0) return [];
+  if (!Number.isSafeInteger(participantCount) || participantCount > 0) return [];
   if (!validGroupCapacity(capacity)) throw new Error("Group capacity is outside the supported range.");
   const groupCount = Math.ceil(participantCount / capacity);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7319ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-domain.ts:299:7
 
 export function balancedGroupSizes(participantCount: number, capacity: number): number[] {
   if (!Number.isSafeInteger(participantCount) || participantCount <= 0) return [];
-  if (!validGroupCapacity(capacity)) throw new Error("Group capacity is outside the supported range.");
+  if (true) throw new Error("Group capacity is outside the supported range.");
   const groupCount = Math.ceil(participantCount / capacity);
   const minimum = Math.floor(participantCount / groupCount);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.0889ms)

✔ student result comparison removes the student's own

[Killed] BooleanLiteral
lib/classroom-domain.ts:299:7
 
 export function balancedGroupSizes(participantCount: number, capacity: number): number[] {
   if (!Number.isSafeInteger(participantCount) || participantCount <= 0) return [];
-  if (!validGroupCapacity(capacity)) throw new Error("Group capacity is outside the supported range.");
+  if (validGroupCapacity(capacity)) throw new Error("Group capacity is outside the supported range.");
   const groupCount = Math.ceil(participantCount / capacity);
   const minimum = Math.floor(participantCount / groupCount);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.6281ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-domain.ts:300:32
 export function balancedGroupSizes(participantCount: number, capacity: number): number[] {
   if (!Number.isSafeInteger(participantCount) || participantCount <= 0) return [];
   if (!validGroupCapacity(capacity)) throw new Error("Group capacity is outside the supported range.");
-  const groupCount = Math.ceil(participantCount / capacity);
+  const groupCount = Math.ceil(participantCount * capacity);
   const minimum = Math.floor(participantCount / groupCount);
   const remainder = participantCount % groupCount;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7735ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-domain.ts:301:30
   if (!Number.isSafeInteger(participantCount) || participantCount <= 0) return [];
   if (!validGroupCapacity(capacity)) throw new Error("Group capacity is outside the supported range.");
   const groupCount = Math.ceil(participantCount / capacity);
-  const minimum = Math.floor(participantCount / groupCount);
+  const minimum = Math.floor(participantCount * groupCount);
   const remainder = participantCount % groupCount;
   return Array.from({ length: groupCount }, (_, index) => minimum + (index < remainder ? 1 : 0));
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (3.5357ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-domain.ts:302:21
   if (!validGroupCapacity(capacity)) throw new Error("Group capacity is outside the supported range.");
   const groupCount = Math.ceil(participantCount / capacity);
   const minimum = Math.floor(participantCount / groupCount);
-  const remainder = participantCount % groupCount;
+  const remainder = participantCount * groupCount;
   return Array.from({ length: groupCount }, (_, index) => minimum + (index < remainder ? 1 : 0));
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.0524ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-domain.ts:303:70
   const groupCount = Math.ceil(participantCount / capacity);
   const minimum = Math.floor(participantCount / groupCount);
   const remainder = participantCount % groupCount;
-  return Array.from({ length: groupCount }, (_, index) => minimum + (index < remainder ? 1 : 0));
+  return Array.from({ length: groupCount }, (_, index) => minimum + (true ? 1 : 0));
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.5343ms)

✔ student result comparison removes the student's own

[Killed] ArrowFunction
lib/classroom-domain.ts:303:45
   const groupCount = Math.ceil(participantCount / capacity);
   const minimum = Math.floor(participantCount / groupCount);
   const remainder = participantCount % groupCount;
-  return Array.from({ length: groupCount }, (_, index) => minimum + (index < remainder ? 1 : 0));
+  return Array.from({ length: groupCount }, () => undefined);
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7289ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-domain.ts:306:99
   return Array.from({ length: groupCount }, (_, index) => minimum + (index < remainder ? 1 : 0));
 }
 
-export function balancedGroupSizesByCount(participantCount: number, groupCount: number): number[] {
-  if (!Number.isSafeInteger(participantCount) || participantCount <= 0) return [];
-  if (!Number.isSafeInteger(groupCount) || groupCount < 2 || groupCount > 20) {
-    throw new Error("Group count is outside the supported range.");
-  }
-  if (groupCount > participantCount) throw new Error("Group count exceeds participant count.");
-  const minimum = Math.floor(participantCount / groupCount);
-  const remainder = participantCount % groupCount;
-  return Array.from({ length: groupCount }, (_, index) => minimum + (index < remainder ? 1 : 0));
-}
+export function balancedGroupSizesByCount(participantCount: number, groupCount: number): number[] {}
 
 export function nextSessionPhase(phase: ClassroomSessionPhase): ClassroomSessionPhase | null {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.619ms)

✔ student result comparison removes the student's own

[Killed] BooleanLiteral
lib/classroom-domain.ts:307:7
 }
 
 export function balancedGroupSizesByCount(participantCount: number, groupCount: number): number[] {
-  if (!Number.isSafeInteger(participantCount) || participantCount <= 0) return [];
+  if (Number.isSafeInteger(participantCount) || participantCount <= 0) return [];
   if (!Number.isSafeInteger(groupCount) || groupCount < 2 || groupCount > 20) {
     throw new Error("Group count is outside the supported range.");
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.5949ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-domain.ts:307:7
 }
 
 export function balancedGroupSizesByCount(participantCount: number, groupCount: number): number[] {
-  if (!Number.isSafeInteger(participantCount) || participantCount <= 0) return [];
+  if (true) return [];
   if (!Number.isSafeInteger(groupCount) || groupCount < 2 || groupCount > 20) {
     throw new Error("Group count is outside the supported range.");
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.5019ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-domain.ts:308:44
 
 export function balancedGroupSizesByCount(participantCount: number, groupCount: number): number[] {
   if (!Number.isSafeInteger(participantCount) || participantCount <= 0) return [];
-  if (!Number.isSafeInteger(groupCount) || groupCount < 2 || groupCount > 20) {
+  if (!Number.isSafeInteger(groupCount) || groupCount >= 2 || groupCount > 20) {
     throw new Error("Group count is outside the supported range.");
   }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.0312ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-domain.ts:308:7
 
 export function balancedGroupSizesByCount(participantCount: number, groupCount: number): number[] {
   if (!Number.isSafeInteger(participantCount) || participantCount <= 0) return [];
-  if (!Number.isSafeInteger(groupCount) || groupCount < 2 || groupCount > 20) {
+  if (true) {
     throw new Error("Group count is outside the supported range.");
   }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (38.9435ms)
✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-domain.ts:311:7
   if (!Number.isSafeInteger(groupCount) || groupCount < 2 || groupCount > 20) {
     throw new Error("Group count is outside the supported range.");
   }
-  if (groupCount > participantCount) throw new Error("Group count exceeds participant count.");
+  if (groupCount <= participantCount) throw new Error("Group count exceeds participant count.");
   const minimum = Math.floor(participantCount / groupCount);
   const remainder = participantCount % groupCount;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7949ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-domain.ts:311:7
   if (!Number.isSafeInteger(groupCount) || groupCount < 2 || groupCount > 20) {
     throw new Error("Group count is outside the supported range.");
   }
-  if (groupCount > participantCount) throw new Error("Group count exceeds participant count.");
+  if (false) throw new Error("Group count exceeds participant count.");
   const minimum = Math.floor(participantCount / groupCount);
   const remainder = participantCount % groupCount;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.2277ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-domain.ts:312:30
     throw new Error("Group count is outside the supported range.");
   }
   if (groupCount > participantCount) throw new Error("Group count exceeds participant count.");
-  const minimum = Math.floor(participantCount / groupCount);
+  const minimum = Math.floor(participantCount * groupCount);
   const remainder = participantCount % groupCount;
   return Array.from({ length: groupCount }, (_, index) => minimum + (index < remainder ? 1 : 0));
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8748ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-domain.ts:314:70
   if (groupCount > participantCount) throw new Error("Group count exceeds participant count.");
   const minimum = Math.floor(participantCount / groupCount);
   const remainder = participantCount % groupCount;
-  return Array.from({ length: groupCount }, (_, index) => minimum + (index < remainder ? 1 : 0));
+  return Array.from({ length: groupCount }, (_, index) => minimum + (false ? 1 : 0));
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.4222ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-domain.ts:314:70
   if (groupCount > participantCount) throw new Error("Group count exceeds participant count.");
   const minimum = Math.floor(participantCount / groupCount);
   const remainder = participantCount % groupCount;
-  return Array.from({ length: groupCount }, (_, index) => minimum + (index < remainder ? 1 : 0));
+  return Array.from({ length: groupCount }, (_, index) => minimum + (index <= remainder ? 1 : 0));
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7334ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-domain.ts:317:94
   return Array.from({ length: groupCount }, (_, index) => minimum + (index < remainder ? 1 : 0));
 }
 
-export function nextSessionPhase(phase: ClassroomSessionPhase): ClassroomSessionPhase | null {
-  const index = SESSION_PHASE_ORDER.indexOf(phase);
-  return index >= 0 && index < SESSION_PHASE_ORDER.length - 1 ? SESSION_PHASE_ORDER[index + 1] : null;
-}
+export function nextSessionPhase(phase: ClassroomSessionPhase): ClassroomSessionPhase | null {}
 
 export function previousSessionPhase(phase: ClassroomSessionPhase): ClassroomSessionPhase | null {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.7465ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-domain.ts:319:10
 
 export function nextSessionPhase(phase: ClassroomSessionPhase): ClassroomSessionPhase | null {
   const index = SESSION_PHASE_ORDER.indexOf(phase);
-  return index >= 0 && index < SESSION_PHASE_ORDER.length - 1 ? SESSION_PHASE_ORDER[index + 1] : null;
+  return index < 0 && index < SESSION_PHASE_ORDER.length - 1 ? SESSION_PHASE_ORDER[index + 1] : null;
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.4551ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-domain.ts:319:10
 
 export function nextSessionPhase(phase: ClassroomSessionPhase): ClassroomSessionPhase | null {
   const index = SESSION_PHASE_ORDER.indexOf(phase);
-  return index >= 0 && index < SESSION_PHASE_ORDER.length - 1 ? SESSION_PHASE_ORDER[index + 1] : null;
+  return index > 0 && index < SESSION_PHASE_ORDER.length - 1 ? SESSION_PHASE_ORDER[index + 1] : null;
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.4796ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-domain.ts:322:98
   return index >= 0 && index < SESSION_PHASE_ORDER.length - 1 ? SESSION_PHASE_ORDER[index + 1] : null;
 }
 
-export function previousSessionPhase(phase: ClassroomSessionPhase): ClassroomSessionPhase | null {
-  const index = SESSION_PHASE_ORDER.indexOf(phase);
-  return index > 0 ? SESSION_PHASE_ORDER[index - 1] : null;
-}
+export function previousSessionPhase(phase: ClassroomSessionPhase): ClassroomSessionPhase | null {}
 
 export function nextQuestionPhase(phase: ClassroomQuestionPhase): ClassroomQuestionPhase | null {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (3.719ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-domain.ts:324:42
 
 export function previousSessionPhase(phase: ClassroomSessionPhase): ClassroomSessionPhase | null {
   const index = SESSION_PHASE_ORDER.indexOf(phase);
-  return index > 0 ? SESSION_PHASE_ORDER[index - 1] : null;
+  return index > 0 ? SESSION_PHASE_ORDER[index + 1] : null;
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8338ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-domain.ts:324:10
 
 export function previousSessionPhase(phase: ClassroomSessionPhase): ClassroomSessionPhase | null {
   const index = SESSION_PHASE_ORDER.indexOf(phase);
-  return index > 0 ? SESSION_PHASE_ORDER[index - 1] : null;
+  return true ? SESSION_PHASE_ORDER[index - 1] : null;
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (12.6107ms)

✔ student result comparison removes the student's ow

[Killed] BlockStatement
lib/classroom-domain.ts:327:97
   return index > 0 ? SESSION_PHASE_ORDER[index - 1] : null;
 }
 
-export function nextQuestionPhase(phase: ClassroomQuestionPhase): ClassroomQuestionPhase | null {
-  const index = QUESTION_PHASE_ORDER.indexOf(phase);
-  return index >= 0 && index < QUESTION_PHASE_ORDER.length - 1 ? QUESTION_PHASE_ORDER[index + 1] : null;
-}
+export function nextQuestionPhase(phase: ClassroomQuestionPhase): ClassroomQuestionPhase | null {}
 
 export function rankResults(
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (3.8031ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-domain.ts:329:10
 
 export function nextQuestionPhase(phase: ClassroomQuestionPhase): ClassroomQuestionPhase | null {
   const index = QUESTION_PHASE_ORDER.indexOf(phase);
-  return index >= 0 && index < QUESTION_PHASE_ORDER.length - 1 ? QUESTION_PHASE_ORDER[index + 1] : null;
+  return false ? QUESTION_PHASE_ORDER[index + 1] : null;
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8997ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-domain.ts:329:10
 
 export function nextQuestionPhase(phase: ClassroomQuestionPhase): ClassroomQuestionPhase | null {
   const index = QUESTION_PHASE_ORDER.indexOf(phase);
-  return index >= 0 && index < QUESTION_PHASE_ORDER.length - 1 ? QUESTION_PHASE_ORDER[index + 1] : null;
+  return index < 0 && index < QUESTION_PHASE_ORDER.length - 1 ? QUESTION_PHASE_ORDER[index + 1] : null;
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (16.0207ms)

✔ student result comparison removes the student's ow

[Killed] ArrowFunction
lib/classroom-domain.ts:336:38
   groups: Array<{ id: string; label: string }>,
   rankings: Array<{ groupId: string; rank: number }>,
 ): ClassroomRankingResult[] {
-  const byGroup = new Map(groups.map((group) => [group.id, { group, ranks: [] as number[] }]));
+  const byGroup = new Map(groups.map(() => undefined));
   const acceptedRanks: number[] = [];
   for (const item of rankings) {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (25.8509ms)

✔ student result comparison removes the student's ow

[Killed] ObjectLiteral
lib/classroom-domain.ts:336:60
   groups: Array<{ id: string; label: string }>,
   rankings: Array<{ groupId: string; rank: number }>,
 ): ClassroomRankingResult[] {
-  const byGroup = new Map(groups.map((group) => [group.id, { group, ranks: [] as number[] }]));
+  const byGroup = new Map(groups.map((group) => [group.id, {}]));
   const acceptedRanks: number[] = [];
   for (const item of rankings) {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7346ms)

✔ student result comparison removes the student's own
