[Killed] BlockStatement
lib/classroom-domain.ts:338:32
 ): ClassroomRankingResult[] {
   const byGroup = new Map(groups.map((group) => [group.id, { group, ranks: [] as number[] }]));
   const acceptedRanks: number[] = [];
-  for (const item of rankings) {
-    const target = byGroup.get(item.groupId);
-    if (target && Number.isSafeInteger(item.rank) && item.rank >= 1) {
-      target.ranks.push(item.rank);
-      acceptedRanks.push(item.rank);
-    }
-  }
+  for (const item of rankings) {}
   const maximumRank = Math.max(1, ...acceptedRanks);
   const compared = [...byGroup.values()].map(({ group, ranks }) => {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.0062ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-domain.ts:340:9
   const acceptedRanks: number[] = [];
   for (const item of rankings) {
     const target = byGroup.get(item.groupId);
-    if (target && Number.isSafeInteger(item.rank) && item.rank >= 1) {
+    if (false) {
       target.ranks.push(item.rank);
       acceptedRanks.push(item.rank);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8312ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-domain.ts:340:54
   const acceptedRanks: number[] = [];
   for (const item of rankings) {
     const target = byGroup.get(item.groupId);
-    if (target && Number.isSafeInteger(item.rank) && item.rank >= 1) {
+    if (target && Number.isSafeInteger(item.rank) && item.rank > 1) {
       target.ranks.push(item.rank);
       acceptedRanks.push(item.rank);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8748ms)

✔ student result comparison removes the student's own

[Killed] MethodExpression
lib/classroom-domain.ts:345:23
       acceptedRanks.push(item.rank);
     }
   }
-  const maximumRank = Math.max(1, ...acceptedRanks);
+  const maximumRank = Math.min(1, ...acceptedRanks);
   const compared = [...byGroup.values()].map(({ group, ranks }) => {
     const rankCounts = Array.from({ length: maximumRank }, (_, index) => ranks.filter((rank) => rank === index + 1).length);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.9849ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-domain.ts:346:68
     }
   }
   const maximumRank = Math.max(1, ...acceptedRanks);
-  const compared = [...byGroup.values()].map(({ group, ranks }) => {
-    const rankCounts = Array.from({ length: maximumRank }, (_, index) => ranks.filter((rank) => rank === index + 1).length);
-    const scores = ranks.map((rank) => maximumRank - rank + 1);
-    return {
-      groupId: group.id,
-      label: group.label,
-      averageScore: scores.length ? scores.reduce((sum, score) => sum + score, 0) / scores.length : 0,
-      maximumScore: maximumRank,
-      ratingCount: ranks.length,
-      rankCounts,
-    };
-  });
+  const compared = [...byGroup.values()].map(({ group, ranks }) => {});
   compared.sort((left, right) => {
     if (left.averageScore !== right.averageScore) return right.averageScore - left.averageScore;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (18.0037ms)

✔ student result comparison removes the student's ow

[Killed] ArrayDeclaration
lib/classroom-domain.ts:346:20
     }
   }
   const maximumRank = Math.max(1, ...acceptedRanks);
-  const compared = [...byGroup.values()].map(({ group, ranks }) => {
+  const compared = [].map(({ group, ranks }) => {
     const rankCounts = Array.from({ length: maximumRank }, (_, index) => ranks.filter((rank) => rank === index + 1).length);
     const scores = ranks.map((rank) => maximumRank - rank + 1);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8959ms)

✔ student result comparison removes the student's own

[Killed] ArrowFunction
lib/classroom-domain.ts:347:60
   }
   const maximumRank = Math.max(1, ...acceptedRanks);
   const compared = [...byGroup.values()].map(({ group, ranks }) => {
-    const rankCounts = Array.from({ length: maximumRank }, (_, index) => ranks.filter((rank) => rank === index + 1).length);
+    const rankCounts = Array.from({ length: maximumRank }, () => undefined);
     const scores = ranks.map((rank) => maximumRank - rank + 1);
     return {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.9014ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-domain.ts:347:97
   }
   const maximumRank = Math.max(1, ...acceptedRanks);
   const compared = [...byGroup.values()].map(({ group, ranks }) => {
-    const rankCounts = Array.from({ length: maximumRank }, (_, index) => ranks.filter((rank) => rank === index + 1).length);
+    const rankCounts = Array.from({ length: maximumRank }, (_, index) => ranks.filter((rank) => false).length);
     const scores = ranks.map((rank) => maximumRank - rank + 1);
     return {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.85ms)

✔ student result comparison removes the student's own g

[Killed] ArrowFunction
lib/classroom-domain.ts:348:30
   const maximumRank = Math.max(1, ...acceptedRanks);
   const compared = [...byGroup.values()].map(({ group, ranks }) => {
     const rankCounts = Array.from({ length: maximumRank }, (_, index) => ranks.filter((rank) => rank === index + 1).length);
-    const scores = ranks.map((rank) => maximumRank - rank + 1);
+    const scores = ranks.map(() => undefined);
     return {
       groupId: group.id,
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8821ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-domain.ts:348:40
   const maximumRank = Math.max(1, ...acceptedRanks);
   const compared = [...byGroup.values()].map(({ group, ranks }) => {
     const rankCounts = Array.from({ length: maximumRank }, (_, index) => ranks.filter((rank) => rank === index + 1).length);
-    const scores = ranks.map((rank) => maximumRank - rank + 1);
+    const scores = ranks.map((rank) => maximumRank + rank + 1);
     return {
       groupId: group.id,
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (18.3237ms)

✔ student result comparison removes the student's ow

[Killed] ArrowFunction
lib/classroom-domain.ts:352:51
     return {
       groupId: group.id,
       label: group.label,
-      averageScore: scores.length ? scores.reduce((sum, score) => sum + score, 0) / scores.length : 0,
+      averageScore: scores.length ? scores.reduce(() => undefined, 0) / scores.length : 0,
       maximumScore: maximumRank,
       ratingCount: ranks.length,
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.3627ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-domain.ts:352:37
     return {
       groupId: group.id,
       label: group.label,
-      averageScore: scores.length ? scores.reduce((sum, score) => sum + score, 0) / scores.length : 0,
+      averageScore: scores.length ? scores.reduce((sum, score) => sum + score, 0) * scores.length : 0,
       maximumScore: maximumRank,
       ratingCount: ranks.length,
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.2035ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-domain.ts:358:34
       rankCounts,
     };
   });
-  compared.sort((left, right) => {
-    if (left.averageScore !== right.averageScore) return right.averageScore - left.averageScore;
-    for (let index = 0; index < maximumRank; index += 1) {
-      if (left.rankCounts[index] !== right.rankCounts[index]) return right.rankCounts[index] - left.rankCounts[index];
-    }
-    return left.label.localeCompare(right.label, "zh-Hant");
-  });
+  compared.sort((left, right) => {});
   const results: ClassroomRankingResult[] = [];
   compared.forEach((entry, index, all) => {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.7768ms)

✔ student result comparison removes the student's own

[Killed] MethodExpression
lib/classroom-domain.ts:358:3
       rankCounts,
     };
   });
-  compared.sort((left, right) => {
-    if (left.averageScore !== right.averageScore) return right.averageScore - left.averageScore;
-    for (let index = 0; index < maximumRank; index += 1) {
-      if (left.rankCounts[index] !== right.rankCounts[index]) return right.rankCounts[index] - left.rankCounts[index];
-    }
-    return left.label.localeCompare(right.label, "zh-Hant");
-  });
+  compared;
   const results: ClassroomRankingResult[] = [];
   compared.forEach((entry, index, all) => {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.2495ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-domain.ts:359:58
     };
   });
   compared.sort((left, right) => {
-    if (left.averageScore !== right.averageScore) return right.averageScore - left.averageScore;
+    if (left.averageScore !== right.averageScore) return right.averageScore + left.averageScore;
     for (let index = 0; index < maximumRank; index += 1) {
       if (left.rankCounts[index] !== right.rankCounts[index]) return right.rankCounts[index] - left.rankCounts[index];
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (24.7151ms)

✔ student result comparison removes the student's ow

[Killed] EqualityOperator
lib/classroom-domain.ts:359:9
     };
   });
   compared.sort((left, right) => {
-    if (left.averageScore !== right.averageScore) return right.averageScore - left.averageScore;
+    if (left.averageScore === right.averageScore) return right.averageScore - left.averageScore;
     for (let index = 0; index < maximumRank; index += 1) {
       if (left.rankCounts[index] !== right.rankCounts[index]) return right.rankCounts[index] - left.rankCounts[index];
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (3.7445ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-domain.ts:360:25
   });
   compared.sort((left, right) => {
     if (left.averageScore !== right.averageScore) return right.averageScore - left.averageScore;
-    for (let index = 0; index < maximumRank; index += 1) {
+    for (let index = 0; false; index += 1) {
       if (left.rankCounts[index] !== right.rankCounts[index]) return right.rankCounts[index] - left.rankCounts[index];
     }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (3.4893ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-domain.ts:360:58
   });
   compared.sort((left, right) => {
     if (left.averageScore !== right.averageScore) return right.averageScore - left.averageScore;
-    for (let index = 0; index < maximumRank; index += 1) {
-      if (left.rankCounts[index] !== right.rankCounts[index]) return right.rankCounts[index] - left.rankCounts[index];
-    }
+    for (let index = 0; index < maximumRank; index += 1) {}
     return left.label.localeCompare(right.label, "zh-Hant");
   });
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.6944ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-domain.ts:361:11
   compared.sort((left, right) => {
     if (left.averageScore !== right.averageScore) return right.averageScore - left.averageScore;
     for (let index = 0; index < maximumRank; index += 1) {
-      if (left.rankCounts[index] !== right.rankCounts[index]) return right.rankCounts[index] - left.rankCounts[index];
+      if (false) return right.rankCounts[index] - left.rankCounts[index];
     }
     return left.label.localeCompare(right.label, "zh-Hant");
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7184ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-domain.ts:361:11
   compared.sort((left, right) => {
     if (left.averageScore !== right.averageScore) return right.averageScore - left.averageScore;
     for (let index = 0; index < maximumRank; index += 1) {
-      if (left.rankCounts[index] !== right.rankCounts[index]) return right.rankCounts[index] - left.rankCounts[index];
+      if (left.rankCounts[index] === right.rankCounts[index]) return right.rankCounts[index] - left.rankCounts[index];
     }
     return left.label.localeCompare(right.label, "zh-Hant");
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (3.9621ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-domain.ts:367:26
   });
   const results: ClassroomRankingResult[] = [];
   compared.forEach((entry, index, all) => {
-    const previous = all[index - 1];
+    const previous = all[index + 1];
     const sameDistribution = previous && entry.averageScore === previous.averageScore
       && entry.rankCounts.every((count, rankIndex) => count === previous.rankCounts[rankIndex]);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8474ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-domain.ts:368:30
   const results: ClassroomRankingResult[] = [];
   compared.forEach((entry, index, all) => {
     const previous = all[index - 1];
-    const sameDistribution = previous && entry.averageScore === previous.averageScore
-      && entry.rankCounts.every((count, rankIndex) => count === previous.rankCounts[rankIndex]);
+    const sameDistribution = false;
     const finalRank = sameDistribution ? results[index - 1].finalRank : index + 1;
     const tied = Boolean(sameDistribution || all[index + 1]
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.2444ms)

✔ student result comparison removes the student's own

[Killed] LogicalOperator
lib/classroom-domain.ts:368:30
   const results: ClassroomRankingResult[] = [];
   compared.forEach((entry, index, all) => {
     const previous = all[index - 1];
-    const sameDistribution = previous && entry.averageScore === previous.averageScore
-      && entry.rankCounts.every((count, rankIndex) => count === previous.rankCounts[rankIndex]);
+    const sameDistribution = previous && entry.averageScore === previous.averageScore || entry.rankCounts.every((count, rankIndex) => count === previous.rankCounts[rankIndex]);
     const finalRank = sameDistribution ? results[index - 1].finalRank : index + 1;
     const tied = Boolean(sameDistribution || all[index + 1]
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (63.652ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-domain.ts:369:55
   compared.forEach((entry, index, all) => {
     const previous = all[index - 1];
     const sameDistribution = previous && entry.averageScore === previous.averageScore
-      && entry.rankCounts.every((count, rankIndex) => count === previous.rankCounts[rankIndex]);
+      && entry.rankCounts.every((count, rankIndex) => false);
     const finalRank = sameDistribution ? results[index - 1].finalRank : index + 1;
     const tied = Boolean(sameDistribution || all[index + 1]
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (39.4539ms)

✔ student result comparison removes the student's ow

[Killed] ArrowFunction
lib/classroom-domain.ts:369:33
   compared.forEach((entry, index, all) => {
     const previous = all[index - 1];
     const sameDistribution = previous && entry.averageScore === previous.averageScore
-      && entry.rankCounts.every((count, rankIndex) => count === previous.rankCounts[rankIndex]);
+      && entry.rankCounts.every(() => undefined);
     const finalRank = sameDistribution ? results[index - 1].finalRank : index + 1;
     const tied = Boolean(sameDistribution || all[index + 1]
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.9879ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-domain.ts:370:50
     const previous = all[index - 1];
     const sameDistribution = previous && entry.averageScore === previous.averageScore
       && entry.rankCounts.every((count, rankIndex) => count === previous.rankCounts[rankIndex]);
-    const finalRank = sameDistribution ? results[index - 1].finalRank : index + 1;
+    const finalRank = sameDistribution ? results[index + 1].finalRank : index + 1;
     const tied = Boolean(sameDistribution || all[index + 1]
       && entry.averageScore === all[index + 1].averageScore
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (19.986ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-domain.ts:370:73
     const previous = all[index - 1];
     const sameDistribution = previous && entry.averageScore === previous.averageScore
       && entry.rankCounts.every((count, rankIndex) => count === previous.rankCounts[rankIndex]);
-    const finalRank = sameDistribution ? results[index - 1].finalRank : index + 1;
+    const finalRank = sameDistribution ? results[index - 1].finalRank : index - 1;
     const tied = Boolean(sameDistribution || all[index + 1]
       && entry.averageScore === all[index + 1].averageScore
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7557ms)

✔ student result comparison removes the student's own
