[Killed] BlockStatement
lib/classroom-mobile-ranking.ts:6:82
   selectedCount: number;
 };
 
-function normalizedSelectedCount(order: string[], selectedCount: number): number {
-  if (!Number.isInteger(selectedCount)) return 0;
-  return Math.min(Math.max(selectedCount, 0), order.length);
-}
+function normalizedSelectedCount(order: string[], selectedCount: number): number {}
 
 export function selectNextRankingChoice(
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.0919ms)

✔ student result comparison removes the student's own

[Killed] BooleanLiteral
lib/classroom-mobile-ranking.ts:7:7
 };
 
 function normalizedSelectedCount(order: string[], selectedCount: number): number {
-  if (!Number.isInteger(selectedCount)) return 0;
+  if (Number.isInteger(selectedCount)) return 0;
   return Math.min(Math.max(selectedCount, 0), order.length);
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.8588ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-mobile-ranking.ts:7:7
 };
 
 function normalizedSelectedCount(order: string[], selectedCount: number): number {
-  if (!Number.isInteger(selectedCount)) return 0;
+  if (true) return 0;
   return Math.min(Math.max(selectedCount, 0), order.length);
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.0888ms)

✔ student result comparison removes the student's own

[Killed] MethodExpression
lib/classroom-mobile-ranking.ts:8:10
 
 function normalizedSelectedCount(order: string[], selectedCount: number): number {
   if (!Number.isInteger(selectedCount)) return 0;
-  return Math.min(Math.max(selectedCount, 0), order.length);
+  return Math.max(Math.max(selectedCount, 0), order.length);
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.2104ms)

✔ student result comparison removes the student's own

[Killed] MethodExpression
lib/classroom-mobile-ranking.ts:8:19
 
 function normalizedSelectedCount(order: string[], selectedCount: number): number {
   if (!Number.isInteger(selectedCount)) return 0;
-  return Math.min(Math.max(selectedCount, 0), order.length);
+  return Math.min(Math.min(selectedCount, 0), order.length);
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (5.2068ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-mobile-ranking.ts:15:23
   order: string[],
   selectedCount: number,
   groupId: string,
-): ProgressiveRanking {
-  const count = normalizedSelectedCount(order, selectedCount);
-  const source = order.indexOf(groupId);
-  if (source < count || source < 0) return { order, selectedCount: count };
-
-  const next = [...order];
-  const [selected] = next.splice(source, 1);
-  next.splice(count, 0, selected);
-  return { order: next, selectedCount: count + 1 };
-}
+): ProgressiveRanking {}
 
 export function undoLastRankingChoice(order: string[], selectedCount: number): ProgressiveRanking {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7802ms)

✔ student result comparison removes the student's own

[Killed] LogicalOperator
lib/classroom-mobile-ranking.ts:18:7
 ): ProgressiveRanking {
   const count = normalizedSelectedCount(order, selectedCount);
   const source = order.indexOf(groupId);
-  if (source < count || source < 0) return { order, selectedCount: count };
+  if (source < count && source < 0) return { order, selectedCount: count };
 
   const next = [...order];
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8591ms)
✔ student result comparison removes the student's own g

[Killed] EqualityOperator
lib/classroom-mobile-ranking.ts:18:7
 ): ProgressiveRanking {
   const count = normalizedSelectedCount(order, selectedCount);
   const source = order.indexOf(groupId);
-  if (source < count || source < 0) return { order, selectedCount: count };
+  if (source >= count || source < 0) return { order, selectedCount: count };
 
   const next = [...order];
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (7.4924ms)

✔ student result comparison removes the student's own

[Killed] ArrayDeclaration
lib/classroom-mobile-ranking.ts:20:16
   const source = order.indexOf(groupId);
   if (source < count || source < 0) return { order, selectedCount: count };
 
-  const next = [...order];
+  const next = [];
   const [selected] = next.splice(source, 1);
   next.splice(count, 0, selected);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.2285ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-mobile-ranking.ts:23:40
   const next = [...order];
   const [selected] = next.splice(source, 1);
   next.splice(count, 0, selected);
-  return { order: next, selectedCount: count + 1 };
+  return { order: next, selectedCount: count - 1 };
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (6.4846ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-mobile-ranking.ts:26:99
   return { order: next, selectedCount: count + 1 };
 }
 
-export function undoLastRankingChoice(order: string[], selectedCount: number): ProgressiveRanking {
-  const count = normalizedSelectedCount(order, selectedCount);
-  return { order, selectedCount: Math.max(0, count - 1) };
-}
+export function undoLastRankingChoice(order: string[], selectedCount: number): ProgressiveRanking {}
 
 export function moveSelectedRankingChoice(
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.1093ms)

✔ student result comparison removes the student's own

[Killed] MethodExpression
lib/classroom-mobile-ranking.ts:28:34
 
 export function undoLastRankingChoice(order: string[], selectedCount: number): ProgressiveRanking {
   const count = normalizedSelectedCount(order, selectedCount);
-  return { order, selectedCount: Math.max(0, count - 1) };
+  return { order, selectedCount: Math.min(0, count - 1) };
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.1437ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-mobile-ranking.ts:28:46
 
 export function undoLastRankingChoice(order: string[], selectedCount: number): ProgressiveRanking {
   const count = normalizedSelectedCount(order, selectedCount);
-  return { order, selectedCount: Math.max(0, count - 1) };
+  return { order, selectedCount: Math.max(0, count + 1) };
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (5.1527ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-mobile-ranking.ts:36:23
   selectedCount: number,
   index: number,
   offset: number,
-): ProgressiveRanking {
-  const count = normalizedSelectedCount(order, selectedCount);
-  const target = index + offset;
-  if (index < 0 || index >= count || target < 0 || target >= count) {
-    return { order, selectedCount: count };
-  }
-
-  const next = [...order];
-  [next[index], next[target]] = [next[target], next[index]];
-  return { order: next, selectedCount: count };
-}
+): ProgressiveRanking {}
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8002ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-mobile-ranking.ts:38:18
   offset: number,
 ): ProgressiveRanking {
   const count = normalizedSelectedCount(order, selectedCount);
-  const target = index + offset;
+  const target = index - offset;
   if (index < 0 || index >= count || target < 0 || target >= count) {
     return { order, selectedCount: count };
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8732ms)
✔ student result comparison removes the student's own g

[Killed] LogicalOperator
lib/classroom-mobile-ranking.ts:39:7
 ): ProgressiveRanking {
   const count = normalizedSelectedCount(order, selectedCount);
   const target = index + offset;
-  if (index < 0 || index >= count || target < 0 || target >= count) {
+  if (index < 0 && index >= count || target < 0 || target >= count) {
     return { order, selectedCount: count };
   }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.4349ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-mobile-ranking.ts:39:52
 ): ProgressiveRanking {
   const count = normalizedSelectedCount(order, selectedCount);
   const target = index + offset;
-  if (index < 0 || index >= count || target < 0 || target >= count) {
+  if (index < 0 || index >= count || target < 0 || false) {
     return { order, selectedCount: count };
   }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.5496ms)

✔ student result comparison removes the student's own

[Killed] ArrayDeclaration
lib/classroom-mobile-ranking.ts:44:33
   }
 
   const next = [...order];
-  [next[index], next[target]] = [next[target], next[index]];
+  [next[index], next[target]] = [];
   return { order: next, selectedCount: count };
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (25.1844ms)

✔ student result comparison removes the student's ow
