[Killed] BlockStatement
lib/classroom-observability.ts:24:81
   return Number(((boundedSuccessful / total) * 100).toFixed(1));
 }
 
-export function normalizeClassroomLogWindow(value: unknown): ClassroomLogWindow {
-  return value === "24h" || value === "30d" ? value : "7d";
-}
+export function normalizeClassroomLogWindow(value: unknown): ClassroomLogWindow {}
 
 export function classroomLogWindowStart(window: ClassroomLogWindow, now = new Date()): string {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (48.3339ms)

✔ student result comparison removes the student's ow

[Killed] ConditionalExpression
lib/classroom-observability.ts:25:29
 }
 
 export function normalizeClassroomLogWindow(value: unknown): ClassroomLogWindow {
-  return value === "24h" || value === "30d" ? value : "7d";
+  return value === "24h" || false ? value : "7d";
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.6737ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-observability.ts:25:29
 }
 
 export function normalizeClassroomLogWindow(value: unknown): ClassroomLogWindow {
-  return value === "24h" || value === "30d" ? value : "7d";
+  return value === "24h" || value !== "30d" ? value : "7d";
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.9238ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-observability.ts:28:95
   return value === "24h" || value === "30d" ? value : "7d";
 }
 
-export function classroomLogWindowStart(window: ClassroomLogWindow, now = new Date()): string {
-  const duration = window === "24h" ? 24 * 60 * 60 * 1_000 : window === "7d" ? 7 * 24 * 60 * 60 * 1_000 : 30 * 24 * 60 * 60 * 1_000;
-  return new Date(now.getTime() - duration).toISOString();
-}
+export function classroomLogWindowStart(window: ClassroomLogWindow, now = new Date()): string {}
 
 export function normalizeClassroomRoute(value: string): string {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.0276ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-observability.ts:29:80
 }
 
 export function classroomLogWindowStart(window: ClassroomLogWindow, now = new Date()): string {
-  const duration = window === "24h" ? 24 * 60 * 60 * 1_000 : window === "7d" ? 7 * 24 * 60 * 60 * 1_000 : 30 * 24 * 60 * 60 * 1_000;
+  const duration = window === "24h" ? 24 * 60 * 60 * 1_000 : window === "7d" ? 7 / 24 * 60 * 60 * 1_000 : 30 * 24 * 60 * 60 * 1_000;
   return new Date(now.getTime() - duration).toISOString();
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8223ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-observability.ts:29:39
 }
 
 export function classroomLogWindowStart(window: ClassroomLogWindow, now = new Date()): string {
-  const duration = window === "24h" ? 24 * 60 * 60 * 1_000 : window === "7d" ? 7 * 24 * 60 * 60 * 1_000 : 30 * 24 * 60 * 60 * 1_000;
+  const duration = window === "24h" ? 24 * 60 / 60 * 1_000 : window === "7d" ? 7 * 24 * 60 * 60 * 1_000 : 30 * 24 * 60 * 60 * 1_000;
   return new Date(now.getTime() - duration).toISOString();
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.0305ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-observability.ts:30:19
 
 export function classroomLogWindowStart(window: ClassroomLogWindow, now = new Date()): string {
   const duration = window === "24h" ? 24 * 60 * 60 * 1_000 : window === "7d" ? 7 * 24 * 60 * 60 * 1_000 : 30 * 24 * 60 * 60 * 1_000;
-  return new Date(now.getTime() - duration).toISOString();
+  return new Date(now.getTime() + duration).toISOString();
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.1492ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-observability.ts:33:64
   return new Date(now.getTime() - duration).toISOString();
 }
 
-export function normalizeClassroomRoute(value: string): string {
-  let pathname = "/unknown";
-  try {
-    pathname = new URL(value, "https://classroom.invalid").pathname;
-  } catch {
-    return pathname;
-  }
-  const normalized = pathname
-    .replace(IDENTIFIER_SEGMENT, "/:id")
-    .replace(/^\/api\/classroom\/join\/[^/]+$/u, "/api/classroom/join/:joinCode");
-  return normalized.startsWith("/api/classroom/") ? normalized.slice(0, 180) : "/unknown";
-}
+export function normalizeClassroomRoute(value: string): string {}
 
 export function classroomLogScope(value: string): { type: "course" | "session" | "question" | "system"; id: string | null } {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (3.7446ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-observability.ts:35:7
 
 export function normalizeClassroomRoute(value: string): string {
   let pathname = "/unknown";
-  try {
-    pathname = new URL(value, "https://classroom.invalid").pathname;
-  } catch {
+  try {} catch {
     return pathname;
   }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (44.5958ms)

✔ student result comparison removes the student's ow

[Survived] BlockStatement
lib/classroom-observability.ts:37:11
   let pathname = "/unknown";
   try {
     pathname = new URL(value, "https://classroom.invalid").pathname;
-  } catch {
-    return pathname;
-  }
+  } catch {}
   const normalized = pathname
     .replace(IDENTIFIER_SEGMENT, "/:id")

[Killed] MethodExpression
lib/classroom-observability.ts:43:10
   const normalized = pathname
     .replace(IDENTIFIER_SEGMENT, "/:id")
     .replace(/^\/api\/classroom\/join\/[^/]+$/u, "/api/classroom/join/:joinCode");
-  return normalized.startsWith("/api/classroom/") ? normalized.slice(0, 180) : "/unknown";
+  return normalized.endsWith("/api/classroom/") ? normalized.slice(0, 180) : "/unknown";
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.6558ms)

✔ student result comparison removes the student's own

[Survived] MethodExpression
lib/classroom-observability.ts:43:53
   const normalized = pathname
     .replace(IDENTIFIER_SEGMENT, "/:id")
     .replace(/^\/api\/classroom\/join\/[^/]+$/u, "/api/classroom/join/:joinCode");
-  return normalized.startsWith("/api/classroom/") ? normalized.slice(0, 180) : "/unknown";
+  return normalized.startsWith("/api/classroom/") ? normalized : "/unknown";
 }
 

[Killed] BlockStatement
lib/classroom-observability.ts:46:125
   return normalized.startsWith("/api/classroom/") ? normalized.slice(0, 180) : "/unknown";
 }
 
-export function classroomLogScope(value: string): { type: "course" | "session" | "question" | "system"; id: string | null } {
-  let pathname = "";
-  try {
-    pathname = new URL(value, "https://classroom.invalid").pathname;
-  } catch {
-    return { type: "system", id: null };
-  }
-  const question = pathname.match(/\/(question-[a-z0-9-]{6,100})(?:\/|$)/iu)?.[1];
-  if (question) return { type: "question", id: question };
-  const session = pathname.match(/\/(session-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
-  if (session) return { type: "session", id: session };
-  const course = pathname.match(/\/(course-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
-  return course ? { type: "course", id: course } : { type: "system", id: null };
-}
+export function classroomLogScope(value: string): { type: "course" | "session" | "question" | "system"; id: string | null } {}
 
 export function normalizeClassroomErrorCode(value: unknown): string | null {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.9896ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-observability.ts:48:7
 
 export function classroomLogScope(value: string): { type: "course" | "session" | "question" | "system"; id: string | null } {
   let pathname = "";
-  try {
-    pathname = new URL(value, "https://classroom.invalid").pathname;
-  } catch {
+  try {} catch {
     return { type: "system", id: null };
   }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.5992ms)

✔ student result comparison removes the student's own

[Killed] StringLiteral
lib/classroom-observability.ts:49:31
 export function classroomLogScope(value: string): { type: "course" | "session" | "question" | "system"; id: string | null } {
   let pathname = "";
   try {
-    pathname = new URL(value, "https://classroom.invalid").pathname;
+    pathname = new URL(value, "").pathname;
   } catch {
     return { type: "system", id: null };
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.4213ms)

✔ student result comparison removes the student's own

[Survived] BlockStatement
lib/classroom-observability.ts:50:11
   let pathname = "";
   try {
     pathname = new URL(value, "https://classroom.invalid").pathname;
-  } catch {
-    return { type: "system", id: null };
-  }
+  } catch {}
   const question = pathname.match(/\/(question-[a-z0-9-]{6,100})(?:\/|$)/iu)?.[1];
   if (question) return { type: "question", id: question };

[Killed] StringLiteral
lib/classroom-observability.ts:51:20
   try {
     pathname = new URL(value, "https://classroom.invalid").pathname;
   } catch {
-    return { type: "system", id: null };
+    return { type: "", id: null };
   }
   const question = pathname.match(/\/(question-[a-z0-9-]{6,100})(?:\/|$)/iu)?.[1];
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (6.4415ms)

✔ student result comparison removes the student's own

[Killed] OptionalChaining
lib/classroom-observability.ts:53:20
   } catch {
     return { type: "system", id: null };
   }
-  const question = pathname.match(/\/(question-[a-z0-9-]{6,100})(?:\/|$)/iu)?.[1];
+  const question = pathname.match(/\/(question-[a-z0-9-]{6,100})(?:\/|$)/iu)[1];
   if (question) return { type: "question", id: question };
   const session = pathname.match(/\/(session-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.3846ms)

✔ student result comparison removes the student's own

[Killed] Regex
lib/classroom-observability.ts:53:35
   } catch {
     return { type: "system", id: null };
   }
-  const question = pathname.match(/\/(question-[a-z0-9-]{6,100})(?:\/|$)/iu)?.[1];
+  const question = pathname.match(/\/(question-[a-z0-9-]{6,100})(?:\/)/iu)?.[1];
   if (question) return { type: "question", id: question };
   const session = pathname.match(/\/(session-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7394ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:54:7
     return { type: "system", id: null };
   }
   const question = pathname.match(/\/(question-[a-z0-9-]{6,100})(?:\/|$)/iu)?.[1];
-  if (question) return { type: "question", id: question };
+  if (false) return { type: "question", id: question };
   const session = pathname.match(/\/(session-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
   if (session) return { type: "session", id: session };
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.1723ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:54:7
     return { type: "system", id: null };
   }
   const question = pathname.match(/\/(question-[a-z0-9-]{6,100})(?:\/|$)/iu)?.[1];
-  if (question) return { type: "question", id: question };
+  if (true) return { type: "question", id: question };
   const session = pathname.match(/\/(session-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
   if (session) return { type: "session", id: session };
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (51.0304ms)

✔ student result comparison removes the student's ow

[Killed] OptionalChaining
lib/classroom-observability.ts:55:19
   }
   const question = pathname.match(/\/(question-[a-z0-9-]{6,100})(?:\/|$)/iu)?.[1];
   if (question) return { type: "question", id: question };
-  const session = pathname.match(/\/(session-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
+  const session = pathname.match(/\/(session-[a-z0-9-]{8,80})(?:\/|$)/iu)[1];
   if (session) return { type: "session", id: session };
   const course = pathname.match(/\/(course-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.2398ms)

✔ student result comparison removes the student's own

[Killed] Regex
lib/classroom-observability.ts:55:34
   }
   const question = pathname.match(/\/(question-[a-z0-9-]{6,100})(?:\/|$)/iu)?.[1];
   if (question) return { type: "question", id: question };
-  const session = pathname.match(/\/(session-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
+  const session = pathname.match(/\/(session-[^a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
   if (session) return { type: "session", id: session };
   const course = pathname.match(/\/(course-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.1205ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:56:7
   const question = pathname.match(/\/(question-[a-z0-9-]{6,100})(?:\/|$)/iu)?.[1];
   if (question) return { type: "question", id: question };
   const session = pathname.match(/\/(session-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
-  if (session) return { type: "session", id: session };
+  if (false) return { type: "session", id: session };
   const course = pathname.match(/\/(course-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
   return course ? { type: "course", id: course } : { type: "system", id: null };
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.2772ms)
✔ student result comparison removes the student's own g

[Killed] ConditionalExpression
lib/classroom-observability.ts:56:7
   const question = pathname.match(/\/(question-[a-z0-9-]{6,100})(?:\/|$)/iu)?.[1];
   if (question) return { type: "question", id: question };
   const session = pathname.match(/\/(session-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
-  if (session) return { type: "session", id: session };
+  if (true) return { type: "session", id: session };
   const course = pathname.match(/\/(course-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
   return course ? { type: "course", id: course } : { type: "system", id: null };
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (43.6214ms)

✔ student result comparison removes the student's ow

[Killed] OptionalChaining
lib/classroom-observability.ts:57:18
   if (question) return { type: "question", id: question };
   const session = pathname.match(/\/(session-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
   if (session) return { type: "session", id: session };
-  const course = pathname.match(/\/(course-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
+  const course = pathname.match(/\/(course-[a-z0-9-]{8,80})(?:\/|$)/iu)[1];
   return course ? { type: "course", id: course } : { type: "system", id: null };
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8219ms)

✔ student result comparison removes the student's own

[Killed] Regex
lib/classroom-observability.ts:57:33
   if (question) return { type: "question", id: question };
   const session = pathname.match(/\/(session-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
   if (session) return { type: "session", id: session };
-  const course = pathname.match(/\/(course-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
+  const course = pathname.match(/\/(course-[^a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
   return course ? { type: "course", id: course } : { type: "system", id: null };
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.2889ms)

✔ student result comparison removes the student's own

[Killed] ObjectLiteral
lib/classroom-observability.ts:58:19
   const session = pathname.match(/\/(session-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
   if (session) return { type: "session", id: session };
   const course = pathname.match(/\/(course-[a-z0-9-]{8,80})(?:\/|$)/iu)?.[1];
-  return course ? { type: "course", id: course } : { type: "system", id: null };
+  return course ? {} : { type: "system", id: null };
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.1955ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-observability.ts:61:76
   return course ? { type: "course", id: course } : { type: "system", id: null };
 }
 
-export function normalizeClassroomErrorCode(value: unknown): string | null {
-  if (typeof value !== "string") return null;
-  const normalized = value.normalize("NFKC").trim().toUpperCase();
-  return SAFE_ERROR_CODE.test(normalized) ? normalized : null;
-}
+export function normalizeClassroomErrorCode(value: unknown): string | null {}
 
 export function classroomOperationOutcome(statusCode: number): ClassroomOperationOutcome {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.646ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-observability.ts:62:7
 }
 
 export function normalizeClassroomErrorCode(value: unknown): string | null {
-  if (typeof value !== "string") return null;
+  if (typeof value === "string") return null;
   const normalized = value.normalize("NFKC").trim().toUpperCase();
   return SAFE_ERROR_CODE.test(normalized) ? normalized : null;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (15.583ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:62:7
 }
 
 export function normalizeClassroomErrorCode(value: unknown): string | null {
-  if (typeof value !== "string") return null;
+  if (true) return null;
   const normalized = value.normalize("NFKC").trim().toUpperCase();
   return SAFE_ERROR_CODE.test(normalized) ? normalized : null;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (3.9038ms)

✔ student result comparison removes the student's own

[Killed] MethodExpression
lib/classroom-observability.ts:63:22
 
 export function normalizeClassroomErrorCode(value: unknown): string | null {
   if (typeof value !== "string") return null;
-  const normalized = value.normalize("NFKC").trim().toUpperCase();
+  const normalized = value.normalize("NFKC").trim().toLowerCase();
   return SAFE_ERROR_CODE.test(normalized) ? normalized : null;
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7024ms)

✔ student result comparison removes the student's own

[Killed] MethodExpression
lib/classroom-observability.ts:63:22
 
 export function normalizeClassroomErrorCode(value: unknown): string | null {
   if (typeof value !== "string") return null;
-  const normalized = value.normalize("NFKC").trim().toUpperCase();
+  const normalized = value.normalize("NFKC").toUpperCase();
   return SAFE_ERROR_CODE.test(normalized) ? normalized : null;
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (43.8709ms)

✔ student result comparison removes the student's ow

[Killed] BlockStatement
lib/classroom-observability.ts:67:90
   return SAFE_ERROR_CODE.test(normalized) ? normalized : null;
 }
 
-export function classroomOperationOutcome(statusCode: number): ClassroomOperationOutcome {
-  if (statusCode >= 500) return "server_error";
-  if (statusCode >= 400) return "client_error";
-  return "success";
-}
+export function classroomOperationOutcome(statusCode: number): ClassroomOperationOutcome {}
 
 export function classroomSecurityRelevant(statusCode: number, errorCode: string | null): boolean {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.2696ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:68:7
 }
 
 export function classroomOperationOutcome(statusCode: number): ClassroomOperationOutcome {
-  if (statusCode >= 500) return "server_error";
+  if (true) return "server_error";
   if (statusCode >= 400) return "client_error";
   return "success";
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (3.8958ms)

✔ student result comparison removes the student's own
