[Killed] EqualityOperator
lib/classroom-observability.ts:68:7
 }
 
 export function classroomOperationOutcome(statusCode: number): ClassroomOperationOutcome {
-  if (statusCode >= 500) return "server_error";
+  if (statusCode > 500) return "server_error";
   if (statusCode >= 400) return "client_error";
   return "success";
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7904ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:69:7
 
 export function classroomOperationOutcome(statusCode: number): ClassroomOperationOutcome {
   if (statusCode >= 500) return "server_error";
-  if (statusCode >= 400) return "client_error";
+  if (false) return "client_error";
   return "success";
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8826ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-observability.ts:69:7
 
 export function classroomOperationOutcome(statusCode: number): ClassroomOperationOutcome {
   if (statusCode >= 500) return "server_error";
-  if (statusCode >= 400) return "client_error";
+  if (statusCode < 400) return "client_error";
   return "success";
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.9922ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-observability.ts:73:98
   return "success";
 }
 
-export function classroomSecurityRelevant(statusCode: number, errorCode: string | null): boolean {
-  if (statusCode === 401 || statusCode === 403 || statusCode === 429) return true;
-  return Boolean(errorCode && /(?:AUTHENTICATION|ACCESS_|PERMISSION_|ORIGIN_|DOMAIN_|RATE_LIMITED|REQUEST_TOO_LARGE|TEST_MODE_)/u.test(errorCode));
-}
+export function classroomSecurityRelevant(statusCode: number, errorCode: string | null): boolean {}
 
 export function boundedDurationMilliseconds(value: number): number {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7636ms)

✔ student result comparison removes the student's own

[Killed] LogicalOperator
lib/classroom-observability.ts:74:7
 }
 
 export function classroomSecurityRelevant(statusCode: number, errorCode: string | null): boolean {
-  if (statusCode === 401 || statusCode === 403 || statusCode === 429) return true;
+  if (statusCode === 401 && statusCode === 403 || statusCode === 429) return true;
   return Boolean(errorCode && /(?:AUTHENTICATION|ACCESS_|PERMISSION_|ORIGIN_|DOMAIN_|RATE_LIMITED|REQUEST_TOO_LARGE|TEST_MODE_)/u.test(errorCode));
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (3.8942ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:74:29
 }
 
 export function classroomSecurityRelevant(statusCode: number, errorCode: string | null): boolean {
-  if (statusCode === 401 || statusCode === 403 || statusCode === 429) return true;
+  if (statusCode === 401 || false || statusCode === 429) return true;
   return Boolean(errorCode && /(?:AUTHENTICATION|ACCESS_|PERMISSION_|ORIGIN_|DOMAIN_|RATE_LIMITED|REQUEST_TOO_LARGE|TEST_MODE_)/u.test(errorCode));
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.1932ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:75:18
 
 export function classroomSecurityRelevant(statusCode: number, errorCode: string | null): boolean {
   if (statusCode === 401 || statusCode === 403 || statusCode === 429) return true;
-  return Boolean(errorCode && /(?:AUTHENTICATION|ACCESS_|PERMISSION_|ORIGIN_|DOMAIN_|RATE_LIMITED|REQUEST_TOO_LARGE|TEST_MODE_)/u.test(errorCode));
+  return Boolean(false);
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (29.8675ms)

✔ student result comparison removes the student's ow

[Killed] LogicalOperator
lib/classroom-observability.ts:75:18
 
 export function classroomSecurityRelevant(statusCode: number, errorCode: string | null): boolean {
   if (statusCode === 401 || statusCode === 403 || statusCode === 429) return true;
-  return Boolean(errorCode && /(?:AUTHENTICATION|ACCESS_|PERMISSION_|ORIGIN_|DOMAIN_|RATE_LIMITED|REQUEST_TOO_LARGE|TEST_MODE_)/u.test(errorCode));
+  return Boolean(errorCode || /(?:AUTHENTICATION|ACCESS_|PERMISSION_|ORIGIN_|DOMAIN_|RATE_LIMITED|REQUEST_TOO_LARGE|TEST_MODE_)/u.test(errorCode));
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8519ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-observability.ts:78:68
   return Boolean(errorCode && /(?:AUTHENTICATION|ACCESS_|PERMISSION_|ORIGIN_|DOMAIN_|RATE_LIMITED|REQUEST_TOO_LARGE|TEST_MODE_)/u.test(errorCode));
 }
 
-export function boundedDurationMilliseconds(value: number): number {
-  if (!Number.isFinite(value) || value <= 0) return 0;
-  return Math.min(120_000, Math.round(value));
-}
+export function boundedDurationMilliseconds(value: number): number {}
 
 export function classroomLogCaptureKind(
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7751ms)

✔ student result comparison removes the student's own

[Killed] BooleanLiteral
lib/classroom-observability.ts:79:7
 }
 
 export function boundedDurationMilliseconds(value: number): number {
-  if (!Number.isFinite(value) || value <= 0) return 0;
+  if (Number.isFinite(value) || value <= 0) return 0;
   return Math.min(120_000, Math.round(value));
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (51.1746ms)

✔ student result comparison removes the student's ow

[Killed] EqualityOperator
lib/classroom-observability.ts:79:34
 }
 
 export function boundedDurationMilliseconds(value: number): number {
-  if (!Number.isFinite(value) || value <= 0) return 0;
+  if (!Number.isFinite(value) || value > 0) return 0;
   return Math.min(120_000, Math.round(value));
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.1148ms)

✔ student result comparison removes the student's own

[Killed] MethodExpression
lib/classroom-observability.ts:80:10
 
 export function boundedDurationMilliseconds(value: number): number {
   if (!Number.isFinite(value) || value <= 0) return 0;
-  return Math.min(120_000, Math.round(value));
+  return Math.max(120_000, Math.round(value));
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (5.0972ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-observability.ts:88:35
   method: string,
   statusCode: number,
   durationMs: number,
-): ClassroomLogCaptureKind | null {
-  if (statusCode >= 400) return "error";
-  if (!["GET", "HEAD", "OPTIONS"].includes(method.toUpperCase())) return "mutation";
-  if (durationMs >= 1_000) return "slow";
-  const sampleByte = Number.parseInt(requestId.replace(/[^a-f0-9]/giu, "").slice(-2), 16);
-  return Number.isFinite(sampleByte) && sampleByte % 10 === 0 ? "sample" : null;
-}
+): ClassroomLogCaptureKind | null {}
 
 export function percentile95(values: number[]): number {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (20.3833ms)

✔ student result comparison removes the student's ow

[Killed] ConditionalExpression
lib/classroom-observability.ts:89:7
   statusCode: number,
   durationMs: number,
 ): ClassroomLogCaptureKind | null {
-  if (statusCode >= 400) return "error";
+  if (false) return "error";
   if (!["GET", "HEAD", "OPTIONS"].includes(method.toUpperCase())) return "mutation";
   if (durationMs >= 1_000) return "slow";
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.2941ms)
✔ student result comparison removes the student's own g

[Killed] ConditionalExpression
lib/classroom-observability.ts:89:7
   statusCode: number,
   durationMs: number,
 ): ClassroomLogCaptureKind | null {
-  if (statusCode >= 400) return "error";
+  if (true) return "error";
   if (!["GET", "HEAD", "OPTIONS"].includes(method.toUpperCase())) return "mutation";
   if (durationMs >= 1_000) return "slow";
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.9425ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:90:7
   durationMs: number,
 ): ClassroomLogCaptureKind | null {
   if (statusCode >= 400) return "error";
-  if (!["GET", "HEAD", "OPTIONS"].includes(method.toUpperCase())) return "mutation";
+  if (true) return "mutation";
   if (durationMs >= 1_000) return "slow";
   const sampleByte = Number.parseInt(requestId.replace(/[^a-f0-9]/giu, "").slice(-2), 16);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.9602ms)

✔ student result comparison removes the student's own

[Killed] MethodExpression
lib/classroom-observability.ts:90:44
   durationMs: number,
 ): ClassroomLogCaptureKind | null {
   if (statusCode >= 400) return "error";
-  if (!["GET", "HEAD", "OPTIONS"].includes(method.toUpperCase())) return "mutation";
+  if (!["GET", "HEAD", "OPTIONS"].includes(method.toLowerCase())) return "mutation";
   if (durationMs >= 1_000) return "slow";
   const sampleByte = Number.parseInt(requestId.replace(/[^a-f0-9]/giu, "").slice(-2), 16);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.0474ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-observability.ts:91:7
 ): ClassroomLogCaptureKind | null {
   if (statusCode >= 400) return "error";
   if (!["GET", "HEAD", "OPTIONS"].includes(method.toUpperCase())) return "mutation";
-  if (durationMs >= 1_000) return "slow";
+  if (durationMs < 1_000) return "slow";
   const sampleByte = Number.parseInt(requestId.replace(/[^a-f0-9]/giu, "").slice(-2), 16);
   return Number.isFinite(sampleByte) && sampleByte % 10 === 0 ? "sample" : null;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.9456ms)
✔ student result comparison removes the student's own g

[Killed] ConditionalExpression
lib/classroom-observability.ts:91:7
 ): ClassroomLogCaptureKind | null {
   if (statusCode >= 400) return "error";
   if (!["GET", "HEAD", "OPTIONS"].includes(method.toUpperCase())) return "mutation";
-  if (durationMs >= 1_000) return "slow";
+  if (false) return "slow";
   const sampleByte = Number.parseInt(requestId.replace(/[^a-f0-9]/giu, "").slice(-2), 16);
   return Number.isFinite(sampleByte) && sampleByte % 10 === 0 ? "sample" : null;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7913ms)

✔ student result comparison removes the student's own

[Killed] MethodExpression
lib/classroom-observability.ts:92:38
   if (statusCode >= 400) return "error";
   if (!["GET", "HEAD", "OPTIONS"].includes(method.toUpperCase())) return "mutation";
   if (durationMs >= 1_000) return "slow";
-  const sampleByte = Number.parseInt(requestId.replace(/[^a-f0-9]/giu, "").slice(-2), 16);
+  const sampleByte = Number.parseInt(requestId.replace(/[^a-f0-9]/giu, ""), 16);
   return Number.isFinite(sampleByte) && sampleByte % 10 === 0 ? "sample" : null;
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (5.6058ms)

✔ student result comparison removes the student's own

[Killed] UnaryOperator
lib/classroom-observability.ts:92:82
   if (statusCode >= 400) return "error";
   if (!["GET", "HEAD", "OPTIONS"].includes(method.toUpperCase())) return "mutation";
   if (durationMs >= 1_000) return "slow";
-  const sampleByte = Number.parseInt(requestId.replace(/[^a-f0-9]/giu, "").slice(-2), 16);
+  const sampleByte = Number.parseInt(requestId.replace(/[^a-f0-9]/giu, "").slice(+2), 16);
   return Number.isFinite(sampleByte) && sampleByte % 10 === 0 ? "sample" : null;
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.2598ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-observability.ts:93:41
   if (!["GET", "HEAD", "OPTIONS"].includes(method.toUpperCase())) return "mutation";
   if (durationMs >= 1_000) return "slow";
   const sampleByte = Number.parseInt(requestId.replace(/[^a-f0-9]/giu, "").slice(-2), 16);
-  return Number.isFinite(sampleByte) && sampleByte % 10 === 0 ? "sample" : null;
+  return Number.isFinite(sampleByte) && sampleByte * 10 === 0 ? "sample" : null;
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.9745ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:93:10
   if (!["GET", "HEAD", "OPTIONS"].includes(method.toUpperCase())) return "mutation";
   if (durationMs >= 1_000) return "slow";
   const sampleByte = Number.parseInt(requestId.replace(/[^a-f0-9]/giu, "").slice(-2), 16);
-  return Number.isFinite(sampleByte) && sampleByte % 10 === 0 ? "sample" : null;
+  return false ? "sample" : null;
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.911ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-observability.ts:96:56
   return Number.isFinite(sampleByte) && sampleByte % 10 === 0 ? "sample" : null;
 }
 
-export function percentile95(values: number[]): number {
-  if (values.length === 0) return 0;
-  const sorted = values.map(boundedDurationMilliseconds).sort((left, right) => left - right);
-  return sorted[Math.max(0, Math.ceil(sorted.length * 0.95) - 1)];
-}
+export function percentile95(values: number[]): number {}
 
 function normalizedText(value: unknown, maximumLength: number): string {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.2672ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:97:7
 }
 
 export function percentile95(values: number[]): number {
-  if (values.length === 0) return 0;
+  if (false) return 0;
   const sorted = values.map(boundedDurationMilliseconds).sort((left, right) => left - right);
   return sorted[Math.max(0, Math.ceil(sorted.length * 0.95) - 1)];
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.6649ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:97:7
 }
 
 export function percentile95(values: number[]): number {
-  if (values.length === 0) return 0;
+  if (true) return 0;
   const sorted = values.map(boundedDurationMilliseconds).sort((left, right) => left - right);
   return sorted[Math.max(0, Math.ceil(sorted.length * 0.95) - 1)];
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.5816ms)

✔ student result comparison removes the student's own

[Killed] MethodExpression
lib/classroom-observability.ts:98:18
 
 export function percentile95(values: number[]): number {
   if (values.length === 0) return 0;
-  const sorted = values.map(boundedDurationMilliseconds).sort((left, right) => left - right);
+  const sorted = values.map(boundedDurationMilliseconds);
   return sorted[Math.max(0, Math.ceil(sorted.length * 0.95) - 1)];
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (42.1837ms)

✔ student result comparison removes the student's ow

[Killed] ArrowFunction
lib/classroom-observability.ts:98:63
 
 export function percentile95(values: number[]): number {
   if (values.length === 0) return 0;
-  const sorted = values.map(boundedDurationMilliseconds).sort((left, right) => left - right);
+  const sorted = values.map(boundedDurationMilliseconds).sort(() => undefined);
   return sorted[Math.max(0, Math.ceil(sorted.length * 0.95) - 1)];
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.6874ms)

✔ student result comparison removes the student's own

[Killed] ArithmeticOperator
lib/classroom-observability.ts:99:29
 export function percentile95(values: number[]): number {
   if (values.length === 0) return 0;
   const sorted = values.map(boundedDurationMilliseconds).sort((left, right) => left - right);
-  return sorted[Math.max(0, Math.ceil(sorted.length * 0.95) - 1)];
+  return sorted[Math.max(0, Math.ceil(sorted.length * 0.95) + 1)];
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (9.1683ms)

✔ student result comparison removes the student's own

[Killed] MethodExpression
lib/classroom-observability.ts:99:17
 export function percentile95(values: number[]): number {
   if (values.length === 0) return 0;
   const sorted = values.map(boundedDurationMilliseconds).sort((left, right) => left - right);
-  return sorted[Math.max(0, Math.ceil(sorted.length * 0.95) - 1)];
+  return sorted[Math.min(0, Math.ceil(sorted.length * 0.95) - 1)];
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8296ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-observability.ts:133:12
   draft: ClassroomIncidentDraft,
   source: ClassroomIncidentRequestEvidence | null,
   verification: ClassroomIncidentRequestEvidence | null,
-): boolean {
-  if (draft.status !== "resolved") return true;
-  if (!draft.sourceRequestId || !draft.verificationRequestId || draft.sourceRequestId === draft.verificationRequestId) return false;
-  if (!source || !verification || verification.outcome !== "success" || verification.release !== draft.fixRelease) return false;
-  if (verification.release.endsWith("-unverified")) return false;
-  const sourceTime = Date.parse(source.occurredAt);
-  const verificationTime = Date.parse(verification.occurredAt);
-  return Number.isFinite(sourceTime) && Number.isFinite(verificationTime) && verificationTime > sourceTime;
-}
+): boolean {}
 
 function resolvedIncidentDraftIsComplete(draft: ClassroomIncidentDraft): boolean {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (5.2813ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-observability.ts:134:7
   source: ClassroomIncidentRequestEvidence | null,
   verification: ClassroomIncidentRequestEvidence | null,
 ): boolean {
-  if (draft.status !== "resolved") return true;
+  if (draft.status === "resolved") return true;
   if (!draft.sourceRequestId || !draft.verificationRequestId || draft.sourceRequestId === draft.verificationRequestId) return false;
   if (!source || !verification || verification.outcome !== "success" || verification.release !== draft.fixRelease) return false;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.9527ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:134:7
   source: ClassroomIncidentRequestEvidence | null,
   verification: ClassroomIncidentRequestEvidence | null,
 ): boolean {
-  if (draft.status !== "resolved") return true;
+  if (false) return true;
   if (!draft.sourceRequestId || !draft.verificationRequestId || draft.sourceRequestId === draft.verificationRequestId) return false;
   if (!source || !verification || verification.outcome !== "success" || verification.release !== draft.fixRelease) return false;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.6922ms)

✔ student result comparison removes the student's own
