[Killed] BooleanLiteral
lib/classroom-observability.ts:135:33
   verification: ClassroomIncidentRequestEvidence | null,
 ): boolean {
   if (draft.status !== "resolved") return true;
-  if (!draft.sourceRequestId || !draft.verificationRequestId || draft.sourceRequestId === draft.verificationRequestId) return false;
+  if (!draft.sourceRequestId || draft.verificationRequestId || draft.sourceRequestId === draft.verificationRequestId) return false;
   if (!source || !verification || verification.outcome !== "success" || verification.release !== draft.fixRelease) return false;
   if (verification.release.endsWith("-unverified")) return false;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.2689ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-observability.ts:135:65
   verification: ClassroomIncidentRequestEvidence | null,
 ): boolean {
   if (draft.status !== "resolved") return true;
-  if (!draft.sourceRequestId || !draft.verificationRequestId || draft.sourceRequestId === draft.verificationRequestId) return false;
+  if (!draft.sourceRequestId || !draft.verificationRequestId || draft.sourceRequestId !== draft.verificationRequestId) return false;
   if (!source || !verification || verification.outcome !== "success" || verification.release !== draft.fixRelease) return false;
   if (verification.release.endsWith("-unverified")) return false;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.2266ms)

✔ student result comparison removes the student's own

[Killed] LogicalOperator
lib/classroom-observability.ts:136:7
 ): boolean {
   if (draft.status !== "resolved") return true;
   if (!draft.sourceRequestId || !draft.verificationRequestId || draft.sourceRequestId === draft.verificationRequestId) return false;
-  if (!source || !verification || verification.outcome !== "success" || verification.release !== draft.fixRelease) return false;
+  if ((!source || !verification) && verification.outcome !== "success" || verification.release !== draft.fixRelease) return false;
   if (verification.release.endsWith("-unverified")) return false;
   const sourceTime = Date.parse(source.occurredAt);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.1846ms)

✔ student result comparison removes the student's own

[Killed] BooleanLiteral
lib/classroom-observability.ts:136:123
 ): boolean {
   if (draft.status !== "resolved") return true;
   if (!draft.sourceRequestId || !draft.verificationRequestId || draft.sourceRequestId === draft.verificationRequestId) return false;
-  if (!source || !verification || verification.outcome !== "success" || verification.release !== draft.fixRelease) return false;
+  if (!source || !verification || verification.outcome !== "success" || verification.release !== draft.fixRelease) return true;
   if (verification.release.endsWith("-unverified")) return false;
   const sourceTime = Date.parse(source.occurredAt);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (5.2273ms)

✔ student result comparison removes the student's own

[Killed] BooleanLiteral
lib/classroom-observability.ts:137:60
   if (draft.status !== "resolved") return true;
   if (!draft.sourceRequestId || !draft.verificationRequestId || draft.sourceRequestId === draft.verificationRequestId) return false;
   if (!source || !verification || verification.outcome !== "success" || verification.release !== draft.fixRelease) return false;
-  if (verification.release.endsWith("-unverified")) return false;
+  if (verification.release.endsWith("-unverified")) return true;
   const sourceTime = Date.parse(source.occurredAt);
   const verificationTime = Date.parse(verification.occurredAt);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.9366ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:137:7
   if (draft.status !== "resolved") return true;
   if (!draft.sourceRequestId || !draft.verificationRequestId || draft.sourceRequestId === draft.verificationRequestId) return false;
   if (!source || !verification || verification.outcome !== "success" || verification.release !== draft.fixRelease) return false;
-  if (verification.release.endsWith("-unverified")) return false;
+  if (false) return false;
   const sourceTime = Date.parse(source.occurredAt);
   const verificationTime = Date.parse(verification.occurredAt);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.8238ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:140:10
   if (verification.release.endsWith("-unverified")) return false;
   const sourceTime = Date.parse(source.occurredAt);
   const verificationTime = Date.parse(verification.occurredAt);
-  return Number.isFinite(sourceTime) && Number.isFinite(verificationTime) && verificationTime > sourceTime;
+  return false;
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.7922ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-observability.ts:140:78
   if (verification.release.endsWith("-unverified")) return false;
   const sourceTime = Date.parse(source.occurredAt);
   const verificationTime = Date.parse(verification.occurredAt);
-  return Number.isFinite(sourceTime) && Number.isFinite(verificationTime) && verificationTime > sourceTime;
+  return Number.isFinite(sourceTime) && Number.isFinite(verificationTime) && verificationTime >= sourceTime;
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8974ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-observability.ts:143:82
   return Number.isFinite(sourceTime) && Number.isFinite(verificationTime) && verificationTime > sourceTime;
 }
 
-function resolvedIncidentDraftIsComplete(draft: ClassroomIncidentDraft): boolean {
-  if (draft.status !== "resolved") return true;
-  return draft.rootCause.length >= 8 && draft.resolution.length >= 8 && draft.fixRelease.length >= 4 &&
-    draft.regressionCheck.length >= 4 && draft.regressionCommand.length >= 3 && draft.regressionEvidence.length >= 8 &&
-    Boolean(draft.sourceRequestId) && Boolean(draft.verificationRequestId) &&
-    draft.sourceRequestId !== draft.verificationRequestId && normalizeClassroomRelease(draft.fixRelease) === draft.fixRelease &&
-    !draft.fixRelease.endsWith("-unverified") && draft.verificationResult === "passed";
-}
+function resolvedIncidentDraftIsComplete(draft: ClassroomIncidentDraft): boolean {}
 
 export function normalizeClassroomIncidentDraft(value: unknown): ClassroomIncidentDraft | null {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.28ms)

✔ student result comparison removes the student's own g

[Killed] ConditionalExpression
lib/classroom-observability.ts:144:7
 }
 
 function resolvedIncidentDraftIsComplete(draft: ClassroomIncidentDraft): boolean {
-  if (draft.status !== "resolved") return true;
+  if (true) return true;
   return draft.rootCause.length >= 8 && draft.resolution.length >= 8 && draft.fixRelease.length >= 4 &&
     draft.regressionCheck.length >= 4 && draft.regressionCommand.length >= 3 && draft.regressionEvidence.length >= 8 &&
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (8.846ms)

✔ student result comparison removes the student's own

[Killed] BooleanLiteral
lib/classroom-observability.ts:144:43
 }
 
 function resolvedIncidentDraftIsComplete(draft: ClassroomIncidentDraft): boolean {
-  if (draft.status !== "resolved") return true;
+  if (draft.status !== "resolved") return false;
   return draft.rootCause.length >= 8 && draft.resolution.length >= 8 && draft.fixRelease.length >= 4 &&
     draft.regressionCheck.length >= 4 && draft.regressionCommand.length >= 3 && draft.regressionEvidence.length >= 8 &&
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.2382ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-observability.ts:145:41
 
 function resolvedIncidentDraftIsComplete(draft: ClassroomIncidentDraft): boolean {
   if (draft.status !== "resolved") return true;
-  return draft.rootCause.length >= 8 && draft.resolution.length >= 8 && draft.fixRelease.length >= 4 &&
+  return draft.rootCause.length >= 8 && draft.resolution.length > 8 && draft.fixRelease.length >= 4 &&
     draft.regressionCheck.length >= 4 && draft.regressionCommand.length >= 3 && draft.regressionEvidence.length >= 8 &&
     Boolean(draft.sourceRequestId) && Boolean(draft.verificationRequestId) &&
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7868ms)

✔ student result comparison removes the student's own

[Killed] LogicalOperator
lib/classroom-observability.ts:145:10
 
 function resolvedIncidentDraftIsComplete(draft: ClassroomIncidentDraft): boolean {
   if (draft.status !== "resolved") return true;
-  return draft.rootCause.length >= 8 && draft.resolution.length >= 8 && draft.fixRelease.length >= 4 &&
+  return draft.rootCause.length >= 8 && draft.resolution.length >= 8 || draft.fixRelease.length >= 4 &&
     draft.regressionCheck.length >= 4 && draft.regressionCommand.length >= 3 && draft.regressionEvidence.length >= 8 &&
     Boolean(draft.sourceRequestId) && Boolean(draft.verificationRequestId) &&
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.905ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-observability.ts:146:81
 function resolvedIncidentDraftIsComplete(draft: ClassroomIncidentDraft): boolean {
   if (draft.status !== "resolved") return true;
   return draft.rootCause.length >= 8 && draft.resolution.length >= 8 && draft.fixRelease.length >= 4 &&
-    draft.regressionCheck.length >= 4 && draft.regressionCommand.length >= 3 && draft.regressionEvidence.length >= 8 &&
+    draft.regressionCheck.length >= 4 && draft.regressionCommand.length >= 3 && draft.regressionEvidence.length > 8 &&
     Boolean(draft.sourceRequestId) && Boolean(draft.verificationRequestId) &&
     draft.sourceRequestId !== draft.verificationRequestId && normalizeClassroomRelease(draft.fixRelease) === draft.fixRelease &&
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (15.3762ms)

✔ student result comparison removes the student's ow

[Killed] ConditionalExpression
lib/classroom-observability.ts:146:81
 function resolvedIncidentDraftIsComplete(draft: ClassroomIncidentDraft): boolean {
   if (draft.status !== "resolved") return true;
   return draft.rootCause.length >= 8 && draft.resolution.length >= 8 && draft.fixRelease.length >= 4 &&
-    draft.regressionCheck.length >= 4 && draft.regressionCommand.length >= 3 && draft.regressionEvidence.length >= 8 &&
+    draft.regressionCheck.length >= 4 && draft.regressionCommand.length >= 3 && true &&
     Boolean(draft.sourceRequestId) && Boolean(draft.verificationRequestId) &&
     draft.sourceRequestId !== draft.verificationRequestId && normalizeClassroomRelease(draft.fixRelease) === draft.fixRelease &&
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (18.4028ms)

✔ student result comparison removes the student's ow

[Killed] ConditionalExpression
lib/classroom-observability.ts:148:62
   return draft.rootCause.length >= 8 && draft.resolution.length >= 8 && draft.fixRelease.length >= 4 &&
     draft.regressionCheck.length >= 4 && draft.regressionCommand.length >= 3 && draft.regressionEvidence.length >= 8 &&
     Boolean(draft.sourceRequestId) && Boolean(draft.verificationRequestId) &&
-    draft.sourceRequestId !== draft.verificationRequestId && normalizeClassroomRelease(draft.fixRelease) === draft.fixRelease &&
+    draft.sourceRequestId !== draft.verificationRequestId && true &&
     !draft.fixRelease.endsWith("-unverified") && draft.verificationResult === "passed";
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (5.822ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:148:5
   return draft.rootCause.length >= 8 && draft.resolution.length >= 8 && draft.fixRelease.length >= 4 &&
     draft.regressionCheck.length >= 4 && draft.regressionCommand.length >= 3 && draft.regressionEvidence.length >= 8 &&
     Boolean(draft.sourceRequestId) && Boolean(draft.verificationRequestId) &&
-    draft.sourceRequestId !== draft.verificationRequestId && normalizeClassroomRelease(draft.fixRelease) === draft.fixRelease &&
+    true && normalizeClassroomRelease(draft.fixRelease) === draft.fixRelease &&
     !draft.fixRelease.endsWith("-unverified") && draft.verificationResult === "passed";
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (5.9659ms)

✔ student result comparison removes the student's own

[Killed] MethodExpression
lib/classroom-observability.ts:149:6
     draft.regressionCheck.length >= 4 && draft.regressionCommand.length >= 3 && draft.regressionEvidence.length >= 8 &&
     Boolean(draft.sourceRequestId) && Boolean(draft.verificationRequestId) &&
     draft.sourceRequestId !== draft.verificationRequestId && normalizeClassroomRelease(draft.fixRelease) === draft.fixRelease &&
-    !draft.fixRelease.endsWith("-unverified") && draft.verificationResult === "passed";
+    !draft.fixRelease.startsWith("-unverified") && draft.verificationResult === "passed";
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (3.8156ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-observability.ts:149:50
     draft.regressionCheck.length >= 4 && draft.regressionCommand.length >= 3 && draft.regressionEvidence.length >= 8 &&
     Boolean(draft.sourceRequestId) && Boolean(draft.verificationRequestId) &&
     draft.sourceRequestId !== draft.verificationRequestId && normalizeClassroomRelease(draft.fixRelease) === draft.fixRelease &&
-    !draft.fixRelease.endsWith("-unverified") && draft.verificationResult === "passed";
+    !draft.fixRelease.endsWith("-unverified") && draft.verificationResult !== "passed";
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (5.9553ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:153:7
 }
 
 export function normalizeClassroomIncidentDraft(value: unknown): ClassroomIncidentDraft | null {
-  if (!value || typeof value !== "object" || Array.isArray(value)) return null;
+  if (true) return null;
   const record = value as Record<string, unknown>;
   const title = normalizedText(record.title, 120);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (7.695ms)

✔ student result comparison removes the student's own

[Killed] LogicalOperator
lib/classroom-observability.ts:153:7
 }
 
 export function normalizeClassroomIncidentDraft(value: unknown): ClassroomIncidentDraft | null {
-  if (!value || typeof value !== "object" || Array.isArray(value)) return null;
+  if ((!value || typeof value !== "object") && Array.isArray(value)) return null;
   const record = value as Record<string, unknown>;
   const title = normalizedText(record.title, 120);
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (6.3492ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:165:27
   const regressionCommand = normalizedText(record.regressionCommand, 500);
   const severity = record.severity;
   const status = record.status;
-  const sourceRequestId = normalizedText(record.sourceRequestId, 80) || null;
+  const sourceRequestId = true;
   const verificationRequestId = normalizedText(record.verificationRequestId, 80) || null;
   const verificationResult = record.verificationResult;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.0799ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:165:27
   const regressionCommand = normalizedText(record.regressionCommand, 500);
   const severity = record.severity;
   const status = record.status;
-  const sourceRequestId = normalizedText(record.sourceRequestId, 80) || null;
+  const sourceRequestId = false;
   const verificationRequestId = normalizedText(record.verificationRequestId, 80) || null;
   const verificationResult = record.verificationResult;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8743ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:166:33
   const severity = record.severity;
   const status = record.status;
   const sourceRequestId = normalizedText(record.sourceRequestId, 80) || null;
-  const verificationRequestId = normalizedText(record.verificationRequestId, 80) || null;
+  const verificationRequestId = true;
   const verificationResult = record.verificationResult;
   if (title.length < 4 || symptom.length < 8) return null;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7154ms)

✔ student result comparison removes the student's own

[Killed] LogicalOperator
lib/classroom-observability.ts:166:33
   const severity = record.severity;
   const status = record.status;
   const sourceRequestId = normalizedText(record.sourceRequestId, 80) || null;
-  const verificationRequestId = normalizedText(record.verificationRequestId, 80) || null;
+  const verificationRequestId = normalizedText(record.verificationRequestId, 80) && null;
   const verificationResult = record.verificationResult;
   if (title.length < 4 || symptom.length < 8) return null;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7034ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:168:7
   const sourceRequestId = normalizedText(record.sourceRequestId, 80) || null;
   const verificationRequestId = normalizedText(record.verificationRequestId, 80) || null;
   const verificationResult = record.verificationResult;
-  if (title.length < 4 || symptom.length < 8) return null;
+  if (false) return null;
   if (severity !== "low" && severity !== "medium" && severity !== "high" && severity !== "critical") return null;
   if (status !== "open" && status !== "investigating" && status !== "resolved") return null;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.1301ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:168:7
   const sourceRequestId = normalizedText(record.sourceRequestId, 80) || null;
   const verificationRequestId = normalizedText(record.verificationRequestId, 80) || null;
   const verificationResult = record.verificationResult;
-  if (title.length < 4 || symptom.length < 8) return null;
+  if (false || symptom.length < 8) return null;
   if (severity !== "low" && severity !== "medium" && severity !== "high" && severity !== "critical") return null;
   if (status !== "open" && status !== "investigating" && status !== "resolved") return null;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (5.4976ms)

✔ student result comparison removes the student's own

[Killed] LogicalOperator
lib/classroom-observability.ts:169:7
   const verificationRequestId = normalizedText(record.verificationRequestId, 80) || null;
   const verificationResult = record.verificationResult;
   if (title.length < 4 || symptom.length < 8) return null;
-  if (severity !== "low" && severity !== "medium" && severity !== "high" && severity !== "critical") return null;
+  if (severity !== "low" && severity !== "medium" || severity !== "high" && severity !== "critical") return null;
   if (status !== "open" && status !== "investigating" && status !== "resolved") return null;
   if (sourceRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(sourceRequestId)) return null;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.673ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-observability.ts:169:77
   const verificationRequestId = normalizedText(record.verificationRequestId, 80) || null;
   const verificationResult = record.verificationResult;
   if (title.length < 4 || symptom.length < 8) return null;
-  if (severity !== "low" && severity !== "medium" && severity !== "high" && severity !== "critical") return null;
+  if (severity !== "low" && severity !== "medium" && severity !== "high" && severity === "critical") return null;
   if (status !== "open" && status !== "investigating" && status !== "resolved") return null;
   if (sourceRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(sourceRequestId)) return null;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.9048ms)

✔ student result comparison removes the student's own
