[Killed] EqualityOperator
lib/classroom-observability.ts:170:7
   const verificationResult = record.verificationResult;
   if (title.length < 4 || symptom.length < 8) return null;
   if (severity !== "low" && severity !== "medium" && severity !== "high" && severity !== "critical") return null;
-  if (status !== "open" && status !== "investigating" && status !== "resolved") return null;
+  if (status === "open" && status !== "investigating" && status !== "resolved") return null;
   if (sourceRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(sourceRequestId)) return null;
   if (verificationRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(verificationRequestId)) return null;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7999ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:170:7
   const verificationResult = record.verificationResult;
   if (title.length < 4 || symptom.length < 8) return null;
   if (severity !== "low" && severity !== "medium" && severity !== "high" && severity !== "critical") return null;
-  if (status !== "open" && status !== "investigating" && status !== "resolved") return null;
+  if (false) return null;
   if (sourceRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(sourceRequestId)) return null;
   if (verificationRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(verificationRequestId)) return null;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (5.3787ms)

✔ student result comparison removes the student's own

[Killed] BooleanLiteral
lib/classroom-observability.ts:171:26
   if (title.length < 4 || symptom.length < 8) return null;
   if (severity !== "low" && severity !== "medium" && severity !== "high" && severity !== "critical") return null;
   if (status !== "open" && status !== "investigating" && status !== "resolved") return null;
-  if (sourceRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(sourceRequestId)) return null;
+  if (sourceRequestId && /^req-[a-f0-9-]{16,64}$/u.test(sourceRequestId)) return null;
   if (verificationRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(verificationRequestId)) return null;
   if (verificationResult !== "not_run" && verificationResult !== "passed" && verificationResult !== "failed") return null;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (14.9127ms)

✔ student result comparison removes the student's ow

[Killed] LogicalOperator
lib/classroom-observability.ts:171:7
   if (title.length < 4 || symptom.length < 8) return null;
   if (severity !== "low" && severity !== "medium" && severity !== "high" && severity !== "critical") return null;
   if (status !== "open" && status !== "investigating" && status !== "resolved") return null;
-  if (sourceRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(sourceRequestId)) return null;
+  if (sourceRequestId || !/^req-[a-f0-9-]{16,64}$/u.test(sourceRequestId)) return null;
   if (verificationRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(verificationRequestId)) return null;
   if (verificationResult !== "not_run" && verificationResult !== "passed" && verificationResult !== "failed") return null;
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.6968ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:172:7
   if (severity !== "low" && severity !== "medium" && severity !== "high" && severity !== "critical") return null;
   if (status !== "open" && status !== "investigating" && status !== "resolved") return null;
   if (sourceRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(sourceRequestId)) return null;
-  if (verificationRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(verificationRequestId)) return null;
+  if (false) return null;
   if (verificationResult !== "not_run" && verificationResult !== "passed" && verificationResult !== "failed") return null;
   const draft: ClassroomIncidentDraft = {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.3887ms)

✔ student result comparison removes the student's own

[Killed] BooleanLiteral
lib/classroom-observability.ts:172:32
   if (severity !== "low" && severity !== "medium" && severity !== "high" && severity !== "critical") return null;
   if (status !== "open" && status !== "investigating" && status !== "resolved") return null;
   if (sourceRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(sourceRequestId)) return null;
-  if (verificationRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(verificationRequestId)) return null;
+  if (verificationRequestId && /^req-[a-f0-9-]{16,64}$/u.test(verificationRequestId)) return null;
   if (verificationResult !== "not_run" && verificationResult !== "passed" && verificationResult !== "failed") return null;
   const draft: ClassroomIncidentDraft = {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.2039ms)

✔ student result comparison removes the student's own

[Killed] LogicalOperator
lib/classroom-observability.ts:173:7
   if (status !== "open" && status !== "investigating" && status !== "resolved") return null;
   if (sourceRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(sourceRequestId)) return null;
   if (verificationRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(verificationRequestId)) return null;
-  if (verificationResult !== "not_run" && verificationResult !== "passed" && verificationResult !== "failed") return null;
+  if (verificationResult !== "not_run" && verificationResult !== "passed" || verificationResult !== "failed") return null;
   const draft: ClassroomIncidentDraft = {
     title, severity, status, sourceRequestId, verificationRequestId, symptom, rootCause, resolution,
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (24.836ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-observability.ts:173:43
   if (status !== "open" && status !== "investigating" && status !== "resolved") return null;
   if (sourceRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(sourceRequestId)) return null;
   if (verificationRequestId && !/^req-[a-f0-9-]{16,64}$/u.test(verificationRequestId)) return null;
-  if (verificationResult !== "not_run" && verificationResult !== "passed" && verificationResult !== "failed") return null;
+  if (verificationResult !== "not_run" && true && verificationResult !== "failed") return null;
   const draft: ClassroomIncidentDraft = {
     title, severity, status, sourceRequestId, verificationRequestId, symptom, rootCause, resolution,
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8074ms)

✔ student result comparison removes the student's own
