[Killed] BlockStatement
lib/classroom-workspace-state.ts:7:11
   actorId: string,
   questionId: string | null | undefined,
   group: ClassroomGroup | null | undefined,
-): string {
-  return questionId && group
-    ? `${actorId}:${questionId}:${group.id}:${group.response.version}`
-    : "";
-}
+): string {}
 
 export function completeSavedRankingOrder(
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.7601ms)
✔ student result comparison removes the student's own g

[Killed] ConditionalExpression
lib/classroom-workspace-state.ts:8:10
   questionId: string | null | undefined,
   group: ClassroomGroup | null | undefined,
 ): string {
-  return questionId && group
+  return false
     ? `${actorId}:${questionId}:${group.id}:${group.response.version}`
     : "";
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.431ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-workspace-state.ts:8:10
   questionId: string | null | undefined,
   group: ClassroomGroup | null | undefined,
 ): string {
-  return questionId && group
+  return true
     ? `${actorId}:${questionId}:${group.id}:${group.response.version}`
     : "";
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (10.257ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-workspace-state.ts:16:12
 export function completeSavedRankingOrder(
   eligibleGroupIds: readonly string[],
   savedOrder: readonly string[],
-): boolean {
-  return savedOrder.length === eligibleGroupIds.length
-    && new Set(savedOrder).size === savedOrder.length
-    && eligibleGroupIds.every((groupId) => savedOrder.includes(groupId));
-}
+): boolean {}
 
 export function workspaceRankingKey(
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.4812ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-workspace-state.ts:17:10
   eligibleGroupIds: readonly string[],
   savedOrder: readonly string[],
 ): boolean {
-  return savedOrder.length === eligibleGroupIds.length
+  return savedOrder.length !== eligibleGroupIds.length
     && new Set(savedOrder).size === savedOrder.length
     && eligibleGroupIds.every((groupId) => savedOrder.includes(groupId));
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.4167ms)

✔ student result comparison removes the student's own

[Killed] ConditionalExpression
lib/classroom-workspace-state.ts:17:10
   eligibleGroupIds: readonly string[],
   savedOrder: readonly string[],
 ): boolean {
-  return savedOrder.length === eligibleGroupIds.length
-    && new Set(savedOrder).size === savedOrder.length
-    && eligibleGroupIds.every((groupId) => savedOrder.includes(groupId));
+  return true;
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8991ms)
✔ student result comparison removes the student's own g

[Killed] ConditionalExpression
lib/classroom-workspace-state.ts:18:8
   savedOrder: readonly string[],
 ): boolean {
   return savedOrder.length === eligibleGroupIds.length
-    && new Set(savedOrder).size === savedOrder.length
+    && true
     && eligibleGroupIds.every((groupId) => savedOrder.includes(groupId));
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.2109ms)

✔ student result comparison removes the student's own

[Killed] EqualityOperator
lib/classroom-workspace-state.ts:18:8
   savedOrder: readonly string[],
 ): boolean {
   return savedOrder.length === eligibleGroupIds.length
-    && new Set(savedOrder).size === savedOrder.length
+    && new Set(savedOrder).size !== savedOrder.length
     && eligibleGroupIds.every((groupId) => savedOrder.includes(groupId));
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.9302ms)

✔ student result comparison removes the student's own

[Killed] ArrowFunction
lib/classroom-workspace-state.ts:19:31
 ): boolean {
   return savedOrder.length === eligibleGroupIds.length
     && new Set(savedOrder).size === savedOrder.length
-    && eligibleGroupIds.every((groupId) => savedOrder.includes(groupId));
+    && eligibleGroupIds.every(() => undefined);
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.9872ms)

✔ student result comparison removes the student's own

[Killed] MethodExpression
lib/classroom-workspace-state.ts:19:8
 ): boolean {
   return savedOrder.length === eligibleGroupIds.length
     && new Set(savedOrder).size === savedOrder.length
-    && eligibleGroupIds.every((groupId) => savedOrder.includes(groupId));
+    && eligibleGroupIds.some(groupId => savedOrder.includes(groupId));
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (2.1597ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-workspace-state.ts:28:11
   eligibleGroupIds: readonly string[],
   savedOrder: readonly string[],
   savedOrderIsComplete: boolean,
-): string {
-  const saved = savedOrderIsComplete ? savedOrder.join(",") : "new";
-  return `${actorId}:${questionId}:${eligibleGroupIds.join(",")}:${saved}`;
-}
+): string {}
 
 export function workspaceAnswerLabels(groups: readonly ClassroomGroup[]): Record<string, string> {
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.2452ms)

✔ student result comparison removes the student's own

[Killed] StringLiteral
lib/classroom-workspace-state.ts:29:63
   savedOrder: readonly string[],
   savedOrderIsComplete: boolean,
 ): string {
-  const saved = savedOrderIsComplete ? savedOrder.join(",") : "new";
+  const saved = savedOrderIsComplete ? savedOrder.join(",") : "";
   return `${actorId}:${questionId}:${eligibleGroupIds.join(",")}:${saved}`;
 }
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.8986ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-workspace-state.ts:33:98
   return `${actorId}:${questionId}:${eligibleGroupIds.join(",")}:${saved}`;
 }
 
-export function workspaceAnswerLabels(groups: readonly ClassroomGroup[]): Record<string, string> {
-  return Object.fromEntries(groups.map((group) => [group.id, group.label]));
-}
+export function workspaceAnswerLabels(groups: readonly ClassroomGroup[]): Record<string, string> {}
 
 export function demoTestParticipants(
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (36.2381ms)

✔ student result comparison removes the student's ow

[Killed] ArrowFunction
lib/classroom-workspace-state.ts:34:40
 }
 
 export function workspaceAnswerLabels(groups: readonly ClassroomGroup[]): Record<string, string> {
-  return Object.fromEntries(groups.map((group) => [group.id, group.label]));
+  return Object.fromEntries(groups.map(() => undefined));
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7123ms)

✔ student result comparison removes the student's own

[Killed] BlockStatement
lib/classroom-workspace-state.ts:39:27
 
 export function demoTestParticipants(
   participants: readonly ClassroomParticipant[],
-): ClassroomParticipant[] {
-  return participants.filter((participant) => validDemoStudentId(participant.userId));
-}
+): ClassroomParticipant[] {}
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (1.7753ms)

✔ student result comparison removes the student's own

[Killed] MethodExpression
lib/classroom-workspace-state.ts:40:10
 export function demoTestParticipants(
   participants: readonly ClassroomParticipant[],
 ): ClassroomParticipant[] {
-  return participants.filter((participant) => validDemoStudentId(participant.userId));
+  return participants;
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (34.8125ms)

✔ student result comparison removes the student's ow

[Killed] ArrowFunction
lib/classroom-workspace-state.ts:40:30
 export function demoTestParticipants(
   participants: readonly ClassroomParticipant[],
 ): ClassroomParticipant[] {
-  return participants.filter((participant) => validDemoStudentId(participant.userId));
+  return participants.filter(() => undefined);
 }
 
killedBy: All tests
statusReason: > classroom-response-ranking@0.2.0 test:mutation:unit
> node --experimental-strip-types --test tests/classroom-domain.test.ts tests/classroom-mobile-ranking.test.ts tests/classroom-observability.test.ts tests/classroom-privacy.test.ts tests/classroom-workspace-state.test.ts


✔ ranking position returns a one-based position or null (4.128ms)

✔ student result comparison removes the student's own
